{"id":9,"title":"Cybersecurity Maturity Model Certification (CMMC) v1.0","description":"<span style=\"color: rgb(85, 85, 85); font-family: HelveticaNeue, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 17.6px;\">CMMC stands for “Cybersecurity Maturity Model Certification”. The CMMC will encompass multiple maturity levels that ranges from “Basic Cybersecurity Hygiene” to “Advanced”. The intent is to identify the required CMMC level in RFP sections L and M and use as a “go / no go decision.”</span>","datePublished":"2020-01-30T05:00:00","lastRevisionDate":"2020-01-30T05:00:00","url":"https://www.acq.osd.mil/cmmc/","abstract":"<span style=\"color: rgb(85, 85, 85); font-family: HelveticaNeue, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 17.6px;\">DOD is planning to migrate to the new CMMC framework in order to assess and enhance the cybersecurity posture of the Defense Industrial Base (DIB). The CMMC is intended to serve as a verification mechanism to ensure appropriate levels of cybersecurity practices and processes are in place to ensure basic cyber hygiene as well as protect controlled unclassified information (CUI) that resides on the Department’s industry partners’ networks.</span>","keywords":"DoD, Maturity Levels, CMMC, Cyber Security","securityControls":[{"id":510,"title":"AC.1.001","description":"Limit information system access to authorized users, processes acting on behalf of authorized users, or devices (including other information systems).<div><br></div><div>Access control policies (e.g., identity- or role-based policies, control matrices, and cryptography) control access between active entities or subjects (i.e., users or processes acting on behalf of users) and passive entities or objects (e.g., devices, files, records, and domains) in systems. Access enforcement mechanisms can be employed at the application and service level to provide increased information security. Other systems include systems internal and external to the organization. This requirement focuses on account management for systems and applications. The definition of and enforcement of access authorizations, other than those determined by account type (e.g., privileged verses non—privileged) are addressed in requirement 3.1.2.<br><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":511,"title":"PE.3.136","description":"<div>Enforce safeguarding measures for CUI at alternate work sites.</div><div><br></div><div>Alternate work sites may include government facilities or the private residences of employees. Organizations may define different security requirements for specific alternate work sites or types of sites depending on the work-related activities conducted at those sites.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":512,"title":"PS.2.127","description":"<div>Screen individuals prior to authorizing access to organizational systems containing CUI.</div><div><br></div><div>Personnel security screening (vetting) activities involve the evaluation/assessment of individual’s conduct, integrity, judgment, loyalty, reliability, and stability (i.e., the trustworthiness of the individual) prior to authorizing access to organizational systems containing CUI. The screening activities reflect applicable federal laws, Executive Orders, directives, policies, regulations, and specific criteria established for the level of access required for assigned positions.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Personnel Security (PS)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":513,"title":"PS.2.128","description":"<div>Ensure that organizational systems containing CUI are protected during and after personnel actions such as terminations and transfers.</div><div><br></div><div>Protecting CUI during and after personnel actions may include returning system-related property and conducting exit interviews. System-related property includes hardware authentication tokens, identification cards, system administration technical manuals, keys, and building passes. Exit interviews ensure that individuals who have been terminated understand the security constraints imposed by being former employees and that proper accountability is achieved for system-related property. Security topics of interest at exit interviews can include reminding terminated individuals of nondisclosure agreements and potential limitations on future employment. Exit interviews may not be possible for some terminated individuals, for example, in cases related to job abandonment, illnesses, and non- availability of supervisors. For termination actions, timely execution is essential for individuals terminated for cause. In certain situations, organizations consider disabling the system accounts of individuals that are being terminated prior to the individuals being notified.&nbsp;</div><div><br></div><div>This requirement applies to re-assignments or transfers of individuals when the personnel action is permanent or of such extended durations as to require protection. Organizations define the CUI protections appropriate for the types of re-assignments or transfers, whether permanent or extended. Protections that may be required for transfers or re-assignments to other positions within organizations include returning old and issuing new keys, identification cards, and building passes; changing system access authorizations (i.e., privileges); closing system accounts and establishing new accounts ; and providing for access to official records to which individuals had access at previous work locations and in previous system accounts.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Personnel Security (PS)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":514,"title":"RE.2.137","description":"<div>Regularly perform and test data back-ups.</div><div><br></div><div>Backups are used to recover data in the event of a hardware or software failure. Backups should be performed regularly based on an organizational defined frequency. They should be tested regularly to ensure they are performing as expected.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Recovery (RE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":515,"title":"RE.2.138","description":"<div>Protect the confidentiality of backup CUI at storage locations.</div><div><br></div><div>Organizations can employ cryptographic mechanisms or alternative physical controls to protect the confidentiality of backup information at designated storage locations. Backed- up information containing CUI may include system-level information and user-level information. System-level information includes system-state information, operating system software, application software, and licenses. User-level information includes information other than system-level information.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Recovery (RE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":516,"title":"RE.3.139","description":"<div>Regularly perform complete, comprehensive, and resilient data back-ups as organizationally defined.</div><div><br></div><div>The processes and tools used to properly back up critical information with a proven methodology for timely recovery of it.&nbsp;</div><div><br></div><div>When attackers compromise machines, they often make significant changes to configurations and software. Sometimes attackers also make subtle alterations of data stored on compromised machines, potentially jeopardizing organizational effectiveness with polluted data. When the attackers are discovered, it can be extremely difficult for organizations without a trustworthy data recovery capability to remove all aspects of the attacker’s presence on the machine. This practice is based on the following CIS controls:&nbsp;</div><div><br></div><div>10.1 Ensure that all system data is automatically backed up on a regular basis.&nbsp;</div><div><br></div><div>10.2 Ensure that all of the organization’s key systems are backed up as a complete system, through processes such as imaging, to enable the quick recovery of an entire system.&nbsp;</div><div><br></div><div>10.5 Ensure that all backups have at least one offline (i.e., not accessible via a network connection) backup destination.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Recovery (RE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":517,"title":"RE.5.140","description":"<div>Ensure information processing facilities meet organizationally defined information security continuity, redundancy, and availability requirements.</div><div><br></div><div>This practice is about information system resilience, and requires that the organization take the actions necessary to ensure that the information security components continue to operate as needed to achieve business success and to ensure that the system’s part in protection of GUI is maintained. It should be noted that \"as needed” and \"the system’s part\" may change if, as a result of stress, contingency business operations are conducted; e.g., as part of the organization’s continuity of operations (COOP) planning. Note that redundancy is typically an aspect of resilience, yet is seldom sufficient as the means for achieving needed resilience.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Recovery (RE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":518,"title":"RM.2.141","description":"<div>Periodically assess the risk to organizational operations (including mission, functions, image, or reputation), organizational assets, and individuals, resulting from the operation of organizational systems and the associated processing, storage, or transmission of CUI.</div><div><br></div><div>Clearly defined system boundaries are a prerequisite for effective risk assessments. Such risk assessments consider threats, vulnerabilities, likelihood, and impact to organizational operations, organizational assets, and individuals based 011 the operation and use of organizational systems. Risk assessments also consider risk from external parties (e.g., service providers, contractor operating systems on behalf of the organization, individuals accessing organizational systems, outsourcing entities). Risk assessments, either formal or informal, can be conducted at the organization level, the mission or business process level, or the system level, and at any phase in the system development life cycle.&nbsp;</div><div><br></div><div>NIST SP 800—30 provides guidance on conducting risk assessments.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":519,"title":"RM.2.142","description":"<div>Scan for vulnerabilities in organizational systems and applications periodically and when new vulnerabilities affecting those systems and applications are identified.</div><div><br></div><div>Organizations determine the required vulnerability scanning for all system components, ensuring that potential sources of vulnerabilities such as networked printers, scanners, and copiers are not overlooked. The vulnerabilities to be scanned are readily updated as new vulnerabilities are discovered, announced, and scanning methods developed. This process ensures that potential vulnerabilities in the system are identified and addressed as quickly as possible. Vulnerability analyses for custom software applications may require additional approaches such as static analysis, dynamic analysis, binary analysis, or a hybrid of the three approaches. Organizations can employ these analysis approaches in source code reviews and in a variety of tools (e.g., static analysis tools, web-based application scanners, binary analyzers) and in source code reviews. Vulnerability scanning includes: scanning for patch levels; scanning for functions, ports, protocols, and services that should not be accessible to users or devices; and scanning for improperly configured or incorrectly operating information flow control mechanisms.&nbsp;</div><div><br></div><div>To facilitate interoperability, organizations consider using products that are Security Content Automated Protocol (SCAP) -validated, scanning tools that express vulnerabilities in the Common Vulnerabilities and Exposures (CVE) naming convention, and that employ the Open Vulnerability Assessment Language (OVAL) to determine the presence of system vulnerabilities. Sources for vulnerability information include the Common Weakness Enumeration (CWE) listing and the National Vulnerability Database (NVD).&nbsp;</div><div><br></div><div>Security assessments, such as red team exercises, provide additional sources of potential vulnerabilities for which to scan. Organizations also consider using scanning tools that express vulnerability impact by the Common Vulnerability Scoring System (CVSS). In certain situations, the nature of the vulnerability scanning may be more intrusive or the system component that is the subject of the scanning may contain highly sensitive information. Privileged access authorization to selected system components facilitates thorough vulnerability scanning and protects the sensitive nature of such scanning.&nbsp;</div><div><br></div><div>NIST SP 800-40 provides guidance on vulnerability management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":520,"title":"RM.2.143","description":"<div>Remediate vulnerabilities in accordance with risk assessments.</div><div><br></div><div>Vulnerabilities discovered, for example, via the scanning conducted in response to RM.2.142, are remediated with consideration of the related assessment of risk. The consideration of risk influences the prioritization of remediation efforts and the level of effort to be expended in the remediation for specific vulnerabilities.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":521,"title":"RM.3.144","description":"<div>Periodically perform risk assessments to identify and prioritize risks according to the defined risk categories, risk sources, and risk measurement criteria.</div><div><br></div><div>The organization understands the cybersecurity risk to organizational operations (including mission, functions, image, or reputation), organizational assets, and individuals.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":522,"title":"RM.3.146","description":"<div>Develop and implement risk mitigation plans.</div><div><br></div><div>When the consequences of risk exceed the organization’s risk thresholds and are determined to be unacceptable, the organization must act to address risk to the extent possible. Addressing risk requires the development of response strategies that may include a wide range of activities. In some cases, risk response will require adjustments to current strategies for protecting and sustaining assets and services. Iii other cases, the organization will find itself designing and implementing new controls and service continuity plans. In addition, because not all risk can be mitigated, the organization must be able to address residual risk—the risk that remains and is accepted by the organization after response plans are&nbsp; implemented. This risk must be analyzed and determined to be acceptable before the risk response plan is in place.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":523,"title":"RM.3.147","description":"<div>Manage non-vendor-supported products (e.g., end of life) separately and restrict as necessary to reduce risk.</div><div><br></div><div>Unsupported products are products that are no longer supported by the vendor. Typically they are at the end of their product life. When a product becomes unsupported, there are no security updates and patches, putting the system at an increased exposure to potential attacks. Manage unsupported products separately from your supported products with increased mitigations as necessary to reduce the risk to the organization arising from such exposure.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":524,"title":"RM.4.148","description":"<div>Develop and update as required, a plan for managing supply chain risks associated with the IT supply chain.</div><div><br></div><div>The growing dependence on products, systems, and services from external providers, along with the nature of the relationships with those providers, present an increasing level of risk to an organization. Threat actions that may increase risk include the insertion or use of counterfeits, unauthorized production, tampering, theft, insertion of malicious software and hardware, as well as poor manufacturing and development practices in the supply chain. Supply chain risks can be endemic or systemic within a system element or component, a system, an organization, a sector, or the Nation. Managing supply chain risk is a complex, multifaceted undertaking requiring a coordinated effort across an organization building trust relationships and communicating with both internal and external stakeholders. Supply chain risk management (SCRM) activities involve identifying and assessing risks, determining appropriate mitigating actions, developing SCRM plans to document selected mitigating actions, and monitoring performance against plans. SCRM plans address requirements for developing trustworthy secure and resilient system components and systems, including the application of the security design principles implemented as part of life cycle-based systems security engineering processes. NIST SP 800—161 provides guidance on supply chain risk management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":525,"title":"RM.4.149","description":"<div>Catalog and periodically update threat profiles and adversary TTPs.</div><div><br></div><div>One method that more mature enterprises can use to protect its systems is to employ threat profiles and better understand adversary tools, techniques, and procedures (TTPs). This knowledge can be gained by threat feed information, training, and various frameworks available on the internet. By cataloging (or tracking) and updating threat profiles and adversary tools, techniques, and procedures, an organization can utilize this information when planning for enterprise updates, hunting for adversary activities on a network, and unraveling a complicated attack incident that may have taken place.&nbsp;</div><div><br></div><div>This information is a critical component when planning incident response actions, analyzing alerts on systems, and knowing the most likely asset an adversary is going to go after based on the TTPs they perform. When someone wants to win against an opponent, they typically study their opponent’s techniques and tactics. This knowledge not only allows them to train properly for the event against that opponent, but it allows them to understand what the opponent is doing as well as what actions they’re about to take based on knowledge of their past actions. This information helps an organization to gain a cyber-advantage over the adversary. The purpose of creating threat profiles and adversary TTPs is to help identify and gain knowledge about an adversary that is trying to cause harm to your enterprise. Adversary goals include: accessing an enterprise to steal credentials, accessing proprietary information, stealing technologies, and disrupting operations.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":526,"title":"RM.4.150","description":"<div>Employ threat intelligence to inform the development of the system and security architectures, selection of security solutions, monitoring, threat hunting, and response and recovery activities.</div><div><br></div><div>The constantly changing and increased sophistication of adversaries, especially the advanced persistent threat (APT), makes it more likely that adversaries can successfully compromise or breach organizational systems. Accordingly, threat intelligence can be integrated into and inform each step of the risk management process throughout the system development life cycle. This includes defining system security requirements, developing system and security architectures, selecting security solutions, monitoring (including threat hunting) and remediation efforts.&nbsp;</div><div><br></div><div>Support References:</div><div><ul><li>NIST SP 800—30 provides guidance on risk assessments.</li><li>NIST SP 800-39 provides guidance on the risk management process.&nbsp;</li><li>NIST SP 800—160—1 provides guidance on security architectures and systems security  engineering.&nbsp;</li><li>NIST SP 800-150 provides guidance on cyber threat information sharing.</li></ul></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":527,"title":"RM.4.151","description":"Perform scans for unauthorized ports available across perimeter network boundaries over the organization's Internet network boundaries and other organizationally defined boundaries.<div><br></div><div>Adversaries constantly probe trusted boundaries, such as an organization’s perimeter with the Internet, to find opportunities to create unauthorized connections. Organizations must perform their own scans to determine if unauthorized connections are possible. To help validate access control on network boundaries an organization will schedule actions, such as scanning from various points of presence to assets on various network segment boundaries to identify proper boundary access protections are in place and properly configured. This allows the organization to identify if there are trusted network boundaries that may be breached because of a misconfiguration, or due to the trust between one segment of an environment and another. Basically, this means a one-to-many connection attempt from each network boundary. Identifying the results of each test, where it was trying to access, whether it was successful or not, time of day, IP addresses, etc. can all be used to determine if the actions of the environment match the network protection design, i.e., whether an open port is authorized or unauthorized.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":528,"title":"PE.2.135","description":"<div>Protect and monitor the physical facility and support infrastructure for organizational systems.</div><div><br></div><div>Monitoring of physical access includes publicly accessible areas within organizational facilities. This can be accomplished, for example, by the employment of guards; the use of sensor devices; or the use of video surveillance equipment such as cameras. Examples of support infrastructure include system distribution, transmission, and power lines. Security controls applied to the support infrastructure prevent accidental damage, disruption, and physical tampering. Such controls may also be necessary to prevent eavesdropping or modification of unencrypted transmissions. Physical access controls to support infrastructure include locked wiring closets; disconnected or locked spare jacks; protection of cabling by conduit or cable trays; and wiretapping sensors.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":529,"title":"PE.1.134","description":"<div>Control and manage physical access devices.</div><div><br></div><div>Physical access devices include keys, locks, combinations, and card readers.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":530,"title":"PE.1.133","description":"<div>Maintain audit logs of physical access.</div><div><br></div><div>Organizations have flexibility in the types of audit logs employed. Audit logs can be procedural (e.g., a written log of individuals accessing the facility), automated (e.g., capturing ID provided by a PIV card), or some combination thereof. Physical access points can include facility access points, interior access points to systems or system components requiring supplemental access controls, or both. System components (e.g., workstations, notebook computers) may be in areas designated as publicly accessible with organizations safeguarding access to such devices.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":531,"title":"PE.1.132","description":"<div>Escort visitors and monitor visitor activity.</div><div><br></div><div>Individuals with permanent physical access authorization credentials are not considered Visitors. Audit logs can be used to monitor Visitor activity.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":532,"title":"IR.5.106","description":"<div>In response to cyber incidents, utilize forensic data gathering across impacted systems, ensuring the secure transfer and protection of forensic data.</div><div><br></div><div>Organizations need to have the ability to gather attack forensics as part of responding to security incidents. During a cyberattack an attacker may seek to hide the activities taken to gain access, maintain persistence, and perform reconnaissance of an organization’s networks. However, in the course of their activities the attackers will leave artifacts that indicate their presence. This could be a local event indicating a system logic, files associated with malware, or processes running in the system memory. To avoid detection an attacker may erase local logs or delete files. To allow for a thorough investigation the security operations center (SOC) should seek to collect forensic data from systems in real—time and be able to collect volatile data such as system memory when needed. Collection of the forensic data should be protected during transit and storage.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":533,"title":"IR.5.108","description":"<div>Establish and maintain a cyber incident response team that can investigate an issue physically or virtually at any location within 24 hours.</div><div><br></div><div>A cyber incident response team (CIRT) is a team of experts that assesses, documents, and responds to cyber incidents so that organizational systems can recover quickly and implement the necessary controls to avoid future incidents. CIRT personnel typically include forensic analysts, malicious code analysts, systems security engineers, and real—time operations personnel. The incident handling capability includes performing rapid forensic preservation of evidence and analysis of and response to intrusions. The team members may or may not be full-time but need to be available to respond in the time period required. The size and specialties of the team are based on known and anticipated threats. The team is typically pre-equipped with the software and hardware (e.g., forensic tools) necessary for rapid identification, quarantine, mitigation, and recovery, and is familiar with how to preserve evidence and maintain chain of custody for law enforcement or counter-intelligence uses. For some organizations the CIRT can be implemented as a cross organizational entity or as part of the Security Operations Center (SOC).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":534,"title":"IR.5.110","description":"<div>Perform unannounced operational exercises to demonstrate technical and procedural responses.</div><div><br></div><div>An organization is stronger against a cyber-attack when the incident response capability is proven to be able to handle a live incident. Operational exercises require the use of the operational environment by the staffed, operational personnel; they are not performed in a test environment. By performing this practice an organization is testing their incident response capabilities and procedures as outlined in the IR plan. These tests should be built specifically to launch the organization’s IR process. This will involve the cyber defenders walking through the procedures as well as using their technical solutions. Preparation for an operational exercise might include performing a tabletop exercise to walk through the process. This will help identify shortfalls in the process.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":535,"title":"MA.2.111","description":"<div>Perform maintenance on organizational systems.</div><div><br></div><div>This requirement addresses the information security aspects of the system maintenance program and applies to all types of maintenance to any system component (including hardware, firmware, applications) conducted by any local or non-local entity. System maintenance also includes those components not directly associated with information processing and data or information retention such as scanners, copiers, and printers.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":536,"title":"MA.2.112","description":"<div>Provide controls on the tools, techniques, mechanisms, and personnel used to conduct system maintenance.</div><div><br></div><div>This requirement addresses security-related issues with maintenance tools that are not within the organizational system boundaries that process, store, or transmit CUI, but are used specifically for diagnostic and repair actions on those systems. Organizations have flexibility in determining the controls in place for maintenance tools, but can include approving, controlling, and monitoring the use of such tools. Maintenance tools are potential vehicles for transporting malicious code, either intentionally or unintentionally, into a facility and into organizational systems. Maintenance tools can include hardware, software, and firmware items, for example, hardware and software diagnostic test equipment and hardware and software packet sniffers.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":537,"title":"MA.2.113","description":"<div>Require multi-factor authentication to establish non-local maintenance sessions via external network connections and terminate such connections when non-local maintenance is complete.</div><div><br></div><div>Non-local maintenance and diagnostic activities are those activities conducted by individuals communicating through an external network. The authentication techniques employed in the establishment of these non-local maintenance and diagnostic sessions reflect the network access requirements in IA.3.083.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":538,"title":"MA.2.114","description":"<div>Supervise the maintenance activities of personnel without required access authorization.</div><div><br></div><div>This requirement applies to individuals who are performing hardware or software maintenance on organizational systems, while PE.1.131 addresses physical access for individuals whose maintenance duties place them within the physical protection perimeter of the systems (e.g., custodial staff, physical plant maintenance personnel). Individuals not previously identified as authorized maintenance personnel, such as information technology manufacturers, vendors, consultants, and systems integrators, may require privileged access to organizational systems, for example, when required to conduct maintenance activities with little or no notice. Organizations may choose to issue temporary credentials to these individuals based on organizational risk assessments. Temporary credentials may be for one-time use or for very limited time periods.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":539,"title":"MA.3.115","description":"<div>Ensure equipment removed for off-site maintenance is sanitized of any CUI.</div><div><br></div><div>This requirement addresses the information security aspects of system maintenance that are performed off—site and applies to all types of maintenance to any system component (including applications) conducted by a local or non-local entity (e.g., in—contract, warranty, in-house, software maintenance agreement).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":540,"title":"RM.5.152","description":"<div>Utilize an exception process for non-whitelisted software that includes mitigation techniques.</div><div><br></div><div>Whitelist technologies allow an organization to lock-down their environment in such a way that only allowed software will be able to run on end point and server systems. If a program is not listed on the whitelist, then it is not authorized to run on a given system.&nbsp;</div><div><br></div><div>While this may help keep organizations secure, it is not realistic to expect a stringent whitelist&nbsp;will meet all of the software needs. Most organizations of any size will need to create a process for expanding the whitelist quickly, or create an exception process that will allow individuals to get permission to run software that is needed for their job, but the organization does not want to glob ally accept that software running on all endpoints.&nbsp;</div><div><br></div><div>While whitelist technologies provide a method for organizations to choose which software packages can run in the overall enterprise, they require an organization to understand that some of the users will require software outside of the whitelist (non-Whitelist) to be approved for use. A mature organization should have a procedure in place for determining what software is placed on the whitelist for the organization. At the same time, the organization should have a procedure for determining how software may run through an exception process. The exception process will determine What software needs to be authorized that is not Within the Whitelist. Part of this exception process maybe a rrritigation strategy, such as placing a given machine in a quarantine zone while it is using the software that is not whitelisted. Carefully controlling what software is authorized (whitelist) is a huge benefit to an organization, but this approach may require whitelist&nbsp;exceptions from time to time based on project and user needs. Having a well-defined process and documenting all steps for determining exceptions are key for demonstrating the maturity of the organization when determining what is safe and not safe to run on the enterprise environment.&nbsp;</div><div><br></div><div>An organization also needs to understand that each additional software package authorized to run on their environment adds a level of risk to the organization’s enterprise.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":541,"title":"MA.3.116","description":"<div>Check media containing diagnostic and test programs for malicious code before the media are used in organizational systems.</div><div><br></div><div>If, upon inspection of media containing maintenance diagnostic and test programs, organizations determine that the media contain malicious code, the incident is handled consistent with incident handling policies and procedures.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Maintenance (MA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":542,"title":"MP.2.119","description":"<div>Protect (i.e., physically control and securely store) system media containing CUI, both paper and digital.</div><div><br></div><div>System media includes digital and non-digital media. Digital media includes diskettes, magnetic tapes, external and removable hard disk drives, flash drives, compact disks, and digital video disks. Non-digital media includes paper and microfilm. Protecting digital media includes limiting access to design specifications stored on compact disks or flash drives in the media library to the project leader and any individuals on the development team. Physically controlling system media includes conducting inventories, maintaining accountability for stored media, and ensuring procedures are in place to allow individuals to check out and return media to the media library. Secure storage includes a locked drawer, desk, or cabinet, or a controlled media library.&nbsp; </div><div><br></div><div>Access to CUI on system media can be limited by physically controlling such media, which includes conducting inventories, ensuring procedures are in place to allow individuals to check out and return media to the media library, and maintaining accountability for all stored media.&nbsp;</div><div><br></div><div>NIST SP 800-111 provides guidance on storage encryption technologies for end user devices.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":543,"title":"MP.2.120","description":"<div>Limit CUI access on system media to authorized users.</div><div><br></div><div>Access can be limited by physically controlling system media and secure storage areas. Physically controlling system media includes conducting inventories, ensuring procedures are in place to allow individuals to check out and return system media to the media library, and maintaining accountability for all stored media. Secure storage includes a locked drawer, desk, or cabinet, or a controlled media library.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":544,"title":"MP.2.121","description":"<div>Control the use of removable media on system components.</div><div><br></div><div>In contrast to requirement MP.2.119, which restricts user access to media, this requirement restricts the use of certain types of media on systems, for example, restricting or prohibiting the use of flash drives or external hard disk drives. Organizations can employ technical and non-technical controls (e.g., policies, procedures, and rules of behavior) to control the use of system media. Organizations may control the use of portable storage devices, for example, by using physical cages on workstations to prohibit access to certain external ports, or disabling or removing the ability to insert, read, or write to such devices.&nbsp;</div><div><br></div><div>Organizations may also limit the use of portable storage devices to only approved devices including devices provided by the organization, devices provided by other approved organizations, and devices that are not personally owned. Finally, organizations may control the use of portable storage devices based on the type of device, prohibiting the use of writeable, portable devices, and implementing this restriction by disabling or removing the capability to write to such devices. Malicious code protection mechanisms include anti-virus signature definitions and reputation-based technologies. Many technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the—shelf software, malicious code may also be present in custom-built software. This could include logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":545,"title":"MP.3.122","description":"<div>Mark media with necessary CUI markings and distribution limitations.</div><div><br></div><div>The term security marking refers to the application or use of human-readable security attributes. System media includes digital and non—digital media. Marking of system media reflects applicable federal laws, Executive Orders, directives, policies, and regulations.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":546,"title":"MP.3.123","description":"<div>Prohibit the use of portable storage devices when such devices have no identifiable owner.</div><div><br></div><div>Requiring identifiable owners (e.g., individuals, organizations, or projects) for portable storage devices reduces the overall risk of using such technologies by allowing organizations to assign responsibility and accountability for addressing known vulnerabilities in the devices (e.g., insertion of malicious code).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":547,"title":"MP.3.124","description":"<div>Control access to media containing CUI and maintain accountability for media during transport outside of controlled areas.</div><div><br></div><div>Controlled areas are areas or spaces for which organizations provide physical or procedural controls to meet the requirements established for protecting systems and information. Controls to maintain accountability for media during transport include locked containers and cryptography. Cryptographic mechanisms can provide confidentiality and integrity protections depending upon the mechanisms used. Activities associated with transport include the actual transport as well as those activities such as releasing media for transport and ensuring that media enters the appropriate transport processes. For the actual transport, authorized transport and courier personnel may include individuals external to the organization. Maintaining accountability of media during transport includes restricting transport activities to authorized personnel and tracking and obtaining explicit records of transport activities as the media moves through the transportation system to prevent and detect loss, destruction, or tampering.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":548,"title":"MP.3.125","description":"<div>Implement cryptographic mechanisms to protect the confidentiality of CUI stored on digital media during transport unless otherwise protected by alternative physical safeguards.</div><div><br></div><div>This requirement applies to portable storage devices (e.g., USB memory sticks, digital video disks, compact disks, external or removable hard disk drives).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":549,"title":"PE.1.131","description":"<div>Limit physical access to organizational information systems, equipment, and the respective operating environments to authorized individuals.</div><div><br></div><div>This requirement applies to employees, individuals with permanent physical access authorization credentials, and visitors. Authorized individuals have credentials that include badges, identification cards, and smart cards. Organizations determine the strength of authorization credentials needed consistent with applicable laws, directives, policies, regulations, standards, procedures, and guidelines. This requirement applies only to areas within facilities that have not been designated as publicly accessible.&nbsp;&nbsp;</div><div><br></div><div>Limiting physical access to equipment may include placing equipment in locked rooms or other secured areas and allowing access to authorized individuals only; and placing equipment in locations that can be monitored by organizational personnel. Computing devices, external disk drives, networking devices, monitors, printers, copiers, scanners, facsimile machines, and audio devices are examples of equipment.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Physical Protection (PE)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":550,"title":"MP.1.118","description":"<div>Sanitize or destroy information system media containing Federal Contract Information before disposal or release of reuse.</div><div><br></div><div>This requirement applies to all system media, digital and non—digital, subject to disposal or reuse. Examples include: digital media found in workstations, network components, scanners, copiers, printers, notebook computers, and mobile devices; and non-digital media such as paper and microfilm. The sanitization process removes information from the media such that the information cannot be retrieved or reconstructed. Sanitization techniques, including clearing, purging, cryptographic erase, and destruction, prevent the disclosure of information to unauthorized individuals when such media is released for reuse or disposal. Organizations determine the appropriate sanitization methods, recognizing that destruction maybe necessary when other methods cannot be applied to the media requiring sanitization.&nbsp;</div><div><br></div><div>Organizations use discretion on the employment of sanitization techniques and procedures for media containing information that is in the public domain or publicly releasable or deemed to have no adverse impact on organizations or individuals if released for reuse or disposal. Sanitization of non-digital media includes destruction, removing CUI from documents, or redacting selected sections or words from a document by obscuring the redacted sections or words in a manner equivalent in effectiveness to removing the words or sections from the document. NARA policy and guidance control sanitization processes for controlled unclassified information. NIST SP 800-88 provides guidance on media sanitization.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Media Protection (MP)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":551,"title":"IR.5.102","description":"<div>Use a combination of manual and automated, real-time responses to anomalous activities that match incident patterns.</div><div><br></div><div>Response activities are necessary because the defenders of an organization’s information technology tend to be at a disadvantage compared to the attacker. Defenders must maintain awareness of the latest vulnerabilities, be aware of the vulnerabilities in the organization, have the vulnerabilities remediated, and respond if an attacker finds a vulnerability before it is remediated. Once a vulnerability is discovered, the attacker tends to operates faster than a defender can match. To reduce the time to mitigate an organization should have plans in place to mitigate an attack. Plans must be comprehensive of manual and automated responses.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":552,"title":"RM.5.155","description":"<div>Analyze the effectiveness of security solutions at least annually to address anticipated risk to the system and the organization based on current and accumulated threat intelligence.</div><div><br></div><div>Since sophisticated threats such as the APT are constantly changing, the threat awareness and risk assessment of the organization is dynamic, continuous and informs the actual system operations, the security requirements for the system, and the security solutions employed to meet those requirements. Threat intelligence (i.e., threat information that has been aggregated, transformed, analyzed, interpreted, or enriched to provide the necessary context for decision-making processes) is infused into risk assessment processes and information security operations of the organization to identify any changes required to address the dynamic threat environment.&nbsp;</div><div><span style=\"background-color: transparent; font-size: 1rem;\"><br></span></div><div><span style=\"background-color: transparent; font-size: 1rem;\">NIST SP 800-30 provides guidance on risk assessments.</span><br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Risk Management (RM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":553,"title":"SA.4.171","description":"<div>Establish and maintain a cyber threat hunting capability to search for indicators of compromise in organizational systems and detect, track, and disrupt threats that evade existing controls.</div><div><br></div><div>Threat hunting is an active means of cyber defense in contrast to the traditional protection measures such as firewalls, intrusion detection and prevention systems, quarantining malicious code in sandboxes, and Security Information and Event Management (SIEM) technologies and systems. Cyber threat hunting involves proactively searching organizational systems, networks, and infrastructure for advanced threats. The objective is to track and disrupt cyber adversaries as early as possible in the attack sequence and to measurably improve the speed and accuracy of organizational responses. Indicators of compromise are forensic artifacts from intrusions that are identified on organizational systems at the host or network level, and can include unusual network traffic, unusual file changes, and the presence of malicious code. Threat hunting teams use existing threat intelligence and may create new threat information, which may be shared with peer organizations, Information Sharing and Analysis Organizations (ISAO), Information Sharing and Analysis Centers (ISAC), and relevant government departments and agencies. Threat indicators, signatures, tactics, techniques, and procedures, and other indicators of compromise may be available Via government and non-government cooperatives including Forum of Incident Response and Security Teams, United States Computer Emergency Readiness Team, Defense Industrial Base Cybersecurity Information Sharing Program, and CERT Coordination Center.&nbsp;</div><div><br></div><div>Support References:&nbsp;</div><div><br></div><div><ul><li>NIST SP 800-30 provides guidance on threat and risk assessments, risk analyses, and  risk modeling.&nbsp;</li><li>NIST SP 800-160-2 provides guidance on systems security engineering and cyber resiliency.&nbsp;</li><li>NIST SP 800-150 provides guidance on cyber threat information sharing.</li></ul></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Situational Awareness (SA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":554,"title":"SC.4.202","description":"<div>Employ mechanisms to analyze executable code and scripts (e.g. sandbox) traversing internet network boundaries or other organizationally defined boundaries.</div><div><br></div><div>Advanced malicious executable code has become much better at evading signature-based detection and protection capabilities. Sandboxes and other advanced analytics are more advanced defenses that allow the code or script to execute in an isolated, controlled, and instrumented environment to detect signs of malicious activity.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":555,"title":"SC.4.228","description":"<div>Isolate administration of organizationally defined high-value critical network infrastructure components and servers.</div><div><br></div><div>Organizations apply systems security engineering concepts and principles to identify the high value critical network infrastructure components in their network. High value critical systems are those that if compromised could lead to unauthorized access, use, modification or destruction of large amounts of CUI. Examples include boundary protection systems (e.g., routers, firewalls, intrusion protection and detection systems), critical infrastructure servers (e.g., domain, policy, certificate) and key servers processing CUI (e.g., file, mail, collaboration applications) Securing administration, the ability to alter the configuration of these components, includes delineating physical and logical security boundaries between the data and management interfaces such as through the use of an Out-of—Band network.&nbsp;</div><div><br></div><div>&nbsp;NIST Special Publication 800-160 provides guidance on systems security engineering.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":556,"title":"SC.4.229","description":"<div>Utilize a URL categorization service and implement techniques to enforce URL filtering of websites that are not approved by the organization.</div><div><br></div><div>Typically a high percentage of an organization’s internet traffic is web-based. Web-based information and services is access through a Uniform Resource Locator (URL). Information regarding the provenance and purpose of a URL can be used to restrict access for policy or security concerns.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":557,"title":"SC.5.198","description":"<div>Configure monitoring systems to record packets passing through the organization's Internet network boundaries and other organizationally defined boundaries.</div><div><br></div><div>Configure monitoring systems to record network packets passing through the boundary at each of the organization’s network boundaries.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":558,"title":"SC.5.208","description":"<div>Employ organizationally defined and tailored boundary protections in addition to commercially available solutions.</div><div><br></div><div>Advanced adversaries study and analyze standard commercial security solutions and standard configurations of those systems. They develop and test attack techniques that will not be mitigated by those solutions. Tailoring protections forces the adversary to confront a security solution or configuration that they have not seen anywhere else. They will not have developed a way around it.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":559,"title":"SC.5.230","description":"<div>Enforce port and protocol compliance.</div><div><br></div><div>Malicious actors are able to perform command and control and exfiltration of data by running their own protocols over well-known ports or by hijacking fields within a common protocol. By defining allowed ports and protocols, and only allowing proper protocol syntax on the correct authorized ports, the malicious activity is stopped.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":560,"title":"SI.1.210","description":"<div>Identify, report, and correct information and information system flaws in a timely manner.</div><div><br></div><div>Organizations identify systems that are affected by announced software and firmware flaws including potential vulnerabilities resulting from those flaws and report this information to designated personnel with information security responsibilities. Security-relevant updates include patches, service packs, hot fixes, and anti-virus signatures. Organizations address flaws discovered during security assessments, continuous monitoring, incident response activities, and system error handling. Organizations can take advantage of available resources such as the Common Weakness Enumeration (CWE) database or Common Vulnerabilities and Exposures (CVE) database in remediating flaws discovered in organizational systems. &nbsp;</div><div><br></div><div>Organization-defined time periods for updating security-relevant software and firmware may vary based on a variety of factors including the criticality of the update (i.e., severity of the vulnerability related to the discovered flaw). Some types of flaw remediation may require more testing than other types of remediation. NIST SP 800-40 provides guidance on patch management technologies.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":561,"title":"SI.1.211","description":"<div>Provide protection from malicious code at appropriate locations withing organizational information systems.</div><div><br></div><div>Designated locations include system entry and exit points which may include firewalls, remote access servers, workstations, electronic mail servers, web servers, proxy servers, notebook computers, and mobile devices. Malicious code includes Viruses, worms, Trojan horses, and spyware. Malicious code can be encoded in various formats (e.g., UUENCODE, Unicode), contained within compressed or hidden files, or hidden in files using techniques such as steganograplry. Malicious code can be inserted into systems in a variety of ways including web accesses, electronic mail, electronic mail attachments, and portable storage devices. Malicious code insertions occur through the exploitation of system vulnerabilities.&nbsp;</div><div><br></div><div>Malicious code protection mechanisms include anti-virus signature definitions and reputation-based technologies. A variety of technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off—the-shelf software, malicious code may also be present in custom—built software. This could include logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended. NIST SP 800-83 provides guidance on malware incident prevention.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":562,"title":"SI.1.212","description":"<div>Update malicious code protection mechanisms when new releases are available.</div><div><br></div><div>Malicious code protection mechanisms include anti—virus signature definitions and reputation-based technologies. A variety of technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the-shelf software, malicious code may also be present in custom—built software. This could include logic bombs, back doors, and other types of cyber-attacks that could affect organizational missions/business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":563,"title":"SI.1.213","description":"<div>Perform periodic scans of the information system and real-time scans of files from external sources as files are downloaded, opened, or executed.</div><div><br></div><div>Periodic scans of organizational systems and real—time scans of files from external sources can detect malicious code. Malicious code can be encoded in various formats (e.g., UUENCODE, Unicode), contained within compressed or hidden files, or hidden in files using techniques such as steganograplry. Malicious code can be inserted into systems in a variety of ways including web accesses, electronic mail, electronic mail attachments, and portable storage devices. Malicious code insertions occur through the exploitation of system vulnerabilities.&nbsp;</div><div><br></div><div>Malicious code protection mechanisms include anti-Virus signature definitions and reputation—based technologies. Many technologies and methods exist to limit or eliminate the effects of malicious code. Pervasive configuration management and comprehensive software integrity controls may be effective in preventing execution of unauthorized code. In addition to commercial off-the-shelf software, malicious code may also be present in custom-built software. This could include logic bombs, back doors, and other types of cyber- attacks that could affect organizational missions /business functions. Traditional malicious code protection mechanisms cannot always detect such code. In these situations, organizations rely instead on other safeguards including secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to help ensure that software does not perform functions other than the functions intended.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":564,"title":"SI.2.214","description":"<div>Monitor system security alerts and advisories and take action in response.</div><div><br></div><div>There are many publicly available sources of system security alerts and advisories. The United States Computer Emergency Readiness Team (US-CERT) generates security alerts and advisories to maintain situational awareness across the federal government and in non-federal organizations. Software vendors, subscription services, and relevant industry information sharing and analysis centers (ISACs) may also provide security alerts and advisories. Examples of response actions include notifying relevant external organizations, for example, external mission/business partners, supply chain partners, external service providers, and peer or supporting organizations.&nbsp;</div><div><br></div><div>NIST SP 800—161 provides guidance on supply chain risk management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":565,"title":"SI.2.216","description":"<div>Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks.</div><div><br></div><div>System monitoring includes external and internal monitoring. External monitoring includes the observation of events occurring at the system boundary (i.e., part of perimeter defense and boundary protection). Internal monitoring includes the observation of events occurring within the system. Organizations can monitor systems, for example, by observing audit record activities in real time or by observing other system aspects such as access patterns, characteristics of access, and other actions. The monitoring objectives may guide determination of the events. System monitoring capability is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, scanning tools, audit record monitoring software, network monitoring software). Strategic locations for monitoring devices include selected perimeter locations and near server farms supporting critical applications, with such devices being employed at managed system interfaces. The granularity of monitoring information collected is based on organizational monitoring objectives and the capability of systems to support such objectives.&nbsp;</div><div><br></div><div>System monitoring is an integral part of continuous monitoring and incident response programs. Output from system monitoring serves as input to continuous monitoring and incident response programs. A network connection is any connection with a device that communicates through a network (e.g., local area network, Internet). A remote connection is any connection with a device communicating through an external network (e.g., the Internet). Local, network, and remote connections can be either wired or wireless.&nbsp;</div><div><br></div><div>Unusual or unauthorized activities or conditions related to inbound/ outbound communications traffic include internal traffic that indicates the presence of malicious code in systems or propagating among system components, the unauthorized exporting of information, or signaling to external systems. Evidence of malicious code is used to identify potentially compromised systems or system components. System monitoring requirements, including the need for specific types of system monitoring, may be referenced in other requirements.&nbsp;</div><div><br></div><div>NIST SP 800-94 provides guidance on intrusion detection and prevention systems.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":566,"title":"SI.2.217","description":"<div>Identify unauthorized use of organizational systems.</div><div><br></div><div>System monitoring includes external and internal monitoring. System monitoring can detect unauthorized use of organizational systems. System monitoring is an integral part of continuous monitoring and incident response programs. Monitoring is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, scanning tools, audit record monitoring software, network monitoring software). Output from system monitoring serves as input to continuous monitoring and incident response programs.&nbsp;</div><div><br></div><div>Unusual/unauthorized activities or conditions related to inbound and outbound communications traffic include internal traffic that indicates the presence of malicious code in systems or propagating among system components, the unauthorized exporting of information, or signaling to external systems. Evidence of malicious code is used to identify potentially compromised systems or system components. System monitoring requirements, including the need for specific types of system monitoring, may be referenced in other requirements.&nbsp;</div><div><br></div><div>NIST SP 800-94 provides guidance on intrusion detection and prevention systems.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":567,"title":"SI.3.218","description":"<div>Employ spam protection mechanisms at information system access entry and exit points.</div><div><br></div><div>Spam filtering is used to protect against unwanted, unsolicited, and often harmful emails from reaching end user mailboxes. Spam filters are applied on inbound and outbound emails. Spam filtering helps protect your network from phishing and emails containing viruses and other malicious content. Spam filtering can also be used to mark email as potential spam to caution users reading the email and clicking 011 links within the email. Information system entry and exit points include, for example, firewalls, electronic mail servers, web servers, proxy servers, remote-access servers, workstations, mobile devices, and notebook/laptop computers.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":568,"title":"SI.3.219","description":"<div>Implement email forgery protections.</div><div><br></div><div>Protecting your environment from harmful emails is one of the best ways to reduce the risk of viruses and malware from entering your network. Email attacks are one of the primary attack vectors in use by threat actors to day because of their simplicity and effectiveness for circumventing an organization’s perimeter defenses. Implementing advanced email protections can help mitigate these email-based threats from penetrating an organization’s defenses and landing in the inbox of organizational end users.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":569,"title":"SI.3.220","description":"<div>Utilize sandboxing to detect or block potentially malicious email.</div><div><br></div><div>Minimize the attack surface and the opportunities for attackers to manipulate human behavior through their interaction with web browsers and email systems.&nbsp;</div><div><br></div><div>&nbsp;Web browsers and email clients are very common points of entry and attack because of their technical complexity, flexibility, and their direct interaction with users and with other systems and websites. Content can be crafted to entice or spoof users into taking actions that greatly increase risk and allow introduction of malicious code, loss of valuable data, and other attacks. Since these applications are the main means that users interact with untrusted environments, these are potential targets for both code exploitation and social engineering. This practice is based on the following CIS control:&nbsp; </div><div><br></div><div>7.10 Use sandboxing to analyze and block inbound email attachments with malicious behavior.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":570,"title":"SI.4.221","description":"<div>Use threat indicator information relevant to the information and systems being protected and effective mitigations obtained from external organizations to inform intrusion protection and threat hunting.</div><div><br></div><div>The constantly changing and increasing sophistication of adversaries, especially the advanced persistent threat (APT), make it essential that threat information relating to specific threat events (e.g., TTP, targets) that organizations have experienced, mitigations that organizations have found are effective against certain types of threats, and threat intelligence (i.e., indications and warnings about threats that can occur) be sourced from and shared with trusted organizations. This information can be used by organizational Security Operations Centers (SOC) and incorporated into monitoring capabilities. Threat information sharing includes threat indicators, signatures, and adversary TTP from organizations participating in various threat-sharing consortia, government-commercial cooperatives, and government-government cooperatives (e.g., CERTCC, US—CERT, FIRST, ISAO, DIB CS Program). Unclassified indicators, based on classified information but which can be readily incorporated into organizational intrusion detection systems, are available to qualified non-federal organizations from government sources.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":571,"title":"SC.4.199","description":"<div>Utilize threat intelligence to proactively block DNS requests from reaching malicious domains.</div><div><br></div><div>Threat intelligence can provide information on known, bad domain names. Using that information to prevent access by blocking DNS requests for those domains is one way to prevent an organization from being attacked with watering hole attacks or malicious downloads.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":572,"title":"SC.4.197","description":"<div>Employ physical and logical isolation techniques in the system and security architecture and/or where deemed appropriate by the organization.</div><div><br></div><div>Physical and logical isolation techniques applied at the architectural level of the system can limit the unauthorized flow of CUI; reduce the system attack surface; constrain the number of system components that must be highly secure; and impede the movement of an adversary. Physical and logical isolation techniques when implemented with managed interfaces, can isolate CUI into separate security domains where additional protections can be applied. Any communications across the managed interfaces (i.e., across security domains), constitutes remote access, even if the communications stay within the organization. Separating system components with boundary protection mechanisms provides the capability for increased protection of individual components and to more effectively control information flows between those components. This type of enhanced protection limits the potential harm from and susceptibility to hostile cyber-attacks and errors. The degree of isolation varies depending upon the boundary protection mechanisms selected. Boundary protection mechanisms include routers, gateways, and firewalls separating system components into physically separate networks or subnetworks; virtualization and micro-virtualization techniques; encrypting information flows among system components using distinct encryption keys; cross-domain devices separating subnetworks; and complete physical separation (i.e., air gaps).&nbsp;</div><div><br></div><div>Architectural strategies include logical isolation, partial physical and logical isolation, or complete physical isolation between subsystems and at system boundaries between resources that store, process, transmit, or protect CUI and other resources. Examples include:&nbsp;</div><div><ul><li>Logical isolation: data tagging, digital rights management (DRM), and data loss prevention (DLP) that tags, monitors, and restricts the flow of CUI; virtual machines or containers that separate GUI and other information on hosts; and virtual local area networks (VLAN) that keep GUI and other information separate on networks.&nbsp;</li><li>Partial physical and logical isolation: physically or cryptographically isolated networks; dedicated hardware in data centers; and secure clients that: (a) may not directly access resources outside of the domain (i.e., all networked applications execute as remote virtual applications hosted in a DMZ or internal and protected enclave) ; (b) access via remote virtualized applications or virtual desktop with no file transfer capability other than with dual authorization; or (c) employ dedicated client hardware (e.g., a zero or thin client) or hardware approved for multi-level secure (MLS) usage.</li><li>Complete physical isolation: dedicated (not shared) client and server hardware; physically isolated, stand-alone enclaves for clients and servers; and (a) logically separate network traffic (e.g., using a VLAN) with end—to—end encryption using PKI— based cryptography, or (b) physically isolate it from other traffic.</li></ul></div><div><br></div><div>Isolation techniques are selected based on a risk management perspective that balances the threat, the information being protected, and the cost of the options for protection. Architectural and design decisions are guided and informed by the security requirements and selected solutions.&nbsp;</div><div><br></div><div>NIST SP 800-160-1 provides guidance on developing trustworthy secure systems using systems security engineering practices and security design concepts.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":573,"title":"SC.3.193","description":"<div>Implement a policy restricting the publication of CUI on externally owned, publicly accessible websites (e.g. forums, LinkedIn, Facebook, Twitter).</div><div><br></div><div>Define and enforce a policy that restricts employees from publishing or posting CUI on public websites such as forums and social media outlets.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":574,"title":"SC.3.192","description":"<div>Implement Domain Name System (DNS) filtering services.</div><div><br></div><div>Minimize the attack surface and the opportunities for attackers to manipulate human behavior through their interaction with web browsers and email systems.&nbsp;</div><div><br></div><div>Web browsers and email clients are very common points of entry and attack because of their technical complexity, flexibility, and their direct interaction with users and with other systems and websites. Content can be crafted to entice or spoof users into taking actions that greatly increase risk and allow introduction of malicious code, loss of valuable data, and other attacks. Since these applications are the main means that users interact with untrusted environments, these are potential targets for both code exploitation and social engineering. This practice is based on the following CIS control: &nbsp;</div><div><br></div><div>7.7 Use Domain Name System (DNS) filtering services to help block access to known malicious domains.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":575,"title":"SA.4.173","description":"Design network and system security capabilities to leverage, integrate, and share indicators of compromise.<div><br></div><div>Sharing IoCs (Indicators of Compromise) to systems across an enterprise strengthens an organization’s ability to thwart adversaries. Designing an organization’s security architecture to integrate and share IoCs rapidly increases the likelihood of stopping an attack that is happening at machine speed. Machine speed attacks are attacks that are happening in real-time and use automation to increase the speed at which the attack spreads and performs actions. Effective sharing requires that intelligence services as well as internal resources process IoC information and provide it to the necessary systems in order to act on the information quickly.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Situational Awareness (SA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":576,"title":"SC.1.175","description":"<div>Monitor, control, and protect organizational communications (i.e., information transmitted or received by organizational information systems) at the external boundaries and key internal boundaries of the information systems.</div><div><br></div><div>Communications can be monitored, controlled, and protected at boundary components and by restricting or prohibiting interfaces in organizational systems. Boundary components include gateways, routers, firewalls, guards, network-based malicious code analysis and virtualization systems, or encrypted tunnels implemented within a system security architecture (e. g.. routers protecting firewalls or application gateways residing on protected subnetworks). Restricting or prohibiting interfaces in organizational systems includes restricting external web communications traffic to designated web servers within managed interfaces and prohibiting external traffic that appears to be spoofing internal addresses.&nbsp;</div><div><br></div><div>Organizations consider the shared nature of commercial telecommunications services in the implementation of security requirements associated with the use of such services. Commercial telecommunications services are commonly based on network components and consolidated management systems shared by all attached commercial customers and may also include third party-provided access lines and other service elements. Such transmission services may represent sources of increased risk despite contract security provisions. NIST SP 800-41 provides guidance on firewalls and firewall policy. SP 800-1253 provides guidance on security for virtualization technologies.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":577,"title":"SC.1.176","description":"<div>Implement subnetworks for publicly accessible system components that are physically or logically separated from internal networks.</div><div><br></div><div>Subnetworks that are physically or logically separated from internal networks are referred to as demilitarized zones (DMZs). DMZs are typically implemented with boundary control devices and techniques that include routers, gateways, firewalls, virtualization, or cloud- based technologies.&nbsp;</div><div><br></div><div>NIST SP 800-41 provides guidance on firewalls and firewall policy. SP 800-125B provides guidance on security for virtualization technologies.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":578,"title":"SC.2.178","description":"<div>Prohibit remote activation of collaborative computing devices and provide indication of devices in use to users present at the device.</div><div><br></div><div>Collaborative computing devices include networked white boards, cameras, and microphones. Indication of use includes signals to users when collaborative computing devices are activated. Dedicated video conferencing systems, which rely on one of the participants calling or connecting to the other party to activate the video conference, are excluded.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":579,"title":"SC.2.179","description":"<div>Use encrypted sessions for the management of network devices.</div><div><br></div><div>Management of network devices is a security critical process and needs to have confidentiality protection and authentication to protect against adversaries trying to gain information or change the network infrastructure.&nbsp;</div><div><br></div><div>Confidentiality protection prevents an adversary from sniffing passwords or configuration information. Authenticity protection includes, for example, protecting against man—in—the- middle attacks, session hijacking, and the insertion of false information into communications sessions. This requirement addresses communications protection at the session versus packet level (e.g., sessions in service-oriented architectures providing web—based services).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":580,"title":"SC.3.177","description":"<div>Employ FIPS-validated cryptography when used to protect the confidentiality of CUI.</div><div><br></div><div>Cryptography can be employed to support many security solutions including the protection of controlled unclassified information, the provision of digital signatures, and the enforcement of information separation when authorized individuals have the necessary clearances for such information but lack the necessary formal access approvals. Cryptography can also be used to support random number generation and hash generation. Generally applicable cryptographic standards include FIPS—validated cryptography and / or NSA-approved cryptography.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":581,"title":"SC.3.180","description":"<div>Employ architectural designs, software development techniques, and systems engineering principles that promote effective information security within organizational systems.</div><div><br></div><div>Organizations apply systems security engineering principles to new development systems or systems undergoing major upgrades. For legacy systems, organizations apply systems security engineering principles to system upgrades and modifications to the extent feasible, given the current state of hardware, software, and firmware components within those systems. The application of systems security engineering concepts and principles helps to develop trustworthy, secure, and resilient systems and system components and reduce the susceptibility of organizations to disruptions, hazards, and threats. Examples of these concepts and principles include developing layered protections; establishing security policies, architecture, and controls as the foundation for design; incorporating security requirements into the system development life cycle; delineating physical and logical security boundaries; ensuring that developers are trained on how to build secure software; and performing threat modeling to identify use cases, threat agents, attack vectors and patterns, design patterns, and compensating controls needed to mitigate risk. Organizations that apply security engineering concepts and principles can facilitate the development of trustworthy, secure systems, system components, and system services; reduce risk to acceptable levels; and make informed risk—management decisions.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":582,"title":"SC.3.181","description":"<div>Separate user functionality from system management functionality.</div><div><br></div><div>System management functionality includes functions necessary to administer databases, network components, workstations, or servers, and typically requires privileged user access. The separation of user functionality from system management functionality is physical or logical. Organizations can implement separation of system management functionality from user functionality by using different computers, different central processing units, different instances of operating systems, or different network addresses; virtualization techniques; or combinations of these or other methods, as appropriate. This type of separation includes web administrative interfaces that use separate authentication methods for users of any other system resources. Separation of system and user functionality may include isolating administrative interfaces on different domains and with additional access controls.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":583,"title":"SA.3.169","description":"<div>Receive and respond to cyber threat intelligence from information sharing forums and source and communicate to stakeholders.</div><div><br></div><div>Establish relationships with external organizations to gather cyber threat intelligence information. Cyber threat information from external sources should inform situational awareness activities within the organization. Relevant external threat information is communicated to stakeholders within the organization for appropriate action if needed.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Situational Awareness (SA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":584,"title":"SC.3.182","description":"<div>Prevent unauthorized and unintended information transfer via shared system resources.</div><div><br></div><div>The control of information in shared system resources (e.g., registers, cache memory, main memory, hard disks) is also commonly referred to as object reuse and residual information protection. This requirement prevents information produced by the actions of prior users or roles (or the actions of processes acting on behalf of prior users or roles) from being available to any current users or roles (or current processes acting on behalf of current users or roles) that obtain access to shared system resources after those resources have been released back to the system. This requirement also applies to encrypted representations of information. This requirement does not address information remanence, which refers to residual representation of data that has been nominally deleted; covert channels (including storage or timing channels) Where shared resources are manipulated to violate information flow restrictions; or components within systems for which there are only single users or roles.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":585,"title":"SC.3.184","description":"<div>Prevent remote devices from simultaneously establishing non-remote connections with organizational systems and communicating via some other connection to resources in external networks (i.e. split tunneling).</div><div><br></div><div>Split tunneling might be desirable by remote users to communicate with local system resources such as printers or file servers. However, split tunneling allows unauthorized external connections, making the system more vulnerable to attack and to exfiltration of organizational information. This requirement is implemented in remote devices (e.g., notebook computers, smart phones, and tablets) through configuration settings to disable split tunneling in those devices, and by preventing configuration settings from being readily configurable by users. This requirement is implemented in the system by the detection of split tunneling (or of configuration settings that allow split tunneling) in the remote device, and by prohibiting the connection if the remote device is using split tunneling.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":586,"title":"SC.3.185","description":"<div>Implement cryptographic mechanisms to prevent unauthorized disclosures of CUI during transmission unless otherwise protected by alternative physical safeguards.</div><div><br></div><div>This requirement applies to internal and external networks and any system components that can transmit information including servers, notebook computers, desktop computers, mobile devices, printers, copiers, scanners, and facsimile machines. Communication paths outside the physical protection of controlled boundaries are susceptible to both interception and modification. Organizations relying on commercial providers offering transmission services as commodity services rather than as fully dedicated services (i.e., services which can be highly specialized to individual customer needs), may find it difficult to obtain the necessary assurances regarding the implementation of the controls for transmission confidentiality. In such situations, organizations determine what types of confidentiality services are available in commercial telecommunication service packages. If it is infeasible or impractical to obtain the necessary safeguards and assurances of the effectiveness of the safeguards through appropriate contracting vehicles, organizations implement compensating safeguards or explicitly accept the additional risk. An example of an alternative physical safeguard is a protected distribution system (PDS) where the distribution medium is protected against electronic or physical intercept, thereby ensuring the confidentiality of the information being transmitted.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":587,"title":"SC.3.186","description":"<div>Terminate network connections associated with communications sessions at the end of the sessions or after a defined period of inactivity.</div><div><br></div><div>This requirement applies to internal and external networks. Terminating network connections associated with communications sessions include de-allocating associated TCP/IP address or port pairs at the operating system level, or de-allocating networking assignments at the application level if multiple application sessions are using a single, operating system-level network connection. Time periods of user inactivity may be established by organizations and include time periods by type of network access or for specific network accesses.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":588,"title":"SC.3.187","description":"<div>Establish and manage cryptographic keys for cryptography employed in organizational systems.</div><div><br></div><div>Cryptographic key management and establishment can be performed using manual procedures or mechanisms supported by manual procedures. Organizations define key management requirements in accordance with applicable federal laws, Executive Orders, policies, directives, regulations, and standards specifying appropriate options, levels, and parameters.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":589,"title":"SC.3.188","description":"<div>Control and monitor the use of mobile code.</div><div><br></div><div>Mobile code technologies include Java, IavaScript, ActiveX, Postscript, PDF, Slrockwave movies, Flash animations, and VBScript. Decisions regarding the use of mobile code in organizational systems are based on the potential for the code to cause damage to the systems if used maliciously. Usage restrictions and implementation guidance apply to the selection and use of mobile code installed on servers and mobile code downloaded and executed on individual workstations, notebook computers, and devices (e.g., smart phones). Mobile code policy and procedures address controlling or preventing the development, acquisition, or introduction of unacceptable mobile code in systems, including requiring mobile code to be digitally signed by a trusted source.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":590,"title":"SC.3.189","description":"<div>Control and monitor the use of Voice over Internet Protocol (VoIP) technologies.</div><div><br></div><div>VoIP has different requirements, features, functionality, availability, and service limitations when compared with the Plain Old Telephone Service (POTS) (i.e., the standard telephone service). In contrast, other telephone services are based on high-speed. digital communications lines, such as Integrated Services Digital Network (ISDN) and Fiber Distributed Data Interface (FDDI). The main distinctions between POTS and non-POTS services are speed and bandwidth. To address the threats associated with VoIP, usage restrictions and implementation guidelines are based on the potential for the VoIP technology to cause damage to the system if it is used maliciously. Threats to VoIP are similar to those inherent with any Internet-based application.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":591,"title":"SC.3.190","description":"<div>Protect the authenticity of communication sessions.</div><div><br></div><div>Authenticity protection includes protecting against man-in—the—middle attacks, session hijacking, and the insertion of false information into communications sessions. This requirement addresses communications protection at the session versus packet level (e.g., sessions in service-oriented architectures providing web-based services) and establishes grounds for confidence at both ends of communications sessions in ongoing identities of other parties and in the validity of information transmitted.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":592,"title":"SC.3.191","description":"<div>Protect the confidentiality of CUI at rest.</div><div><br></div><div>Information at rest refers to the state of information when it is not in process or in transit and is located on storage devices as specific components of systems. The focus of protection at rest is not on the type of storage device or the frequency of access but rather the state of the information. Organizations can use different mechanisms to achieve confidentiality protections, including the use of cryptographic mechanisms and file share scanning. Organizations may also use other controls including secure off—line storage in lieu of online storage when adequate protection of information at rest cannot otherwise be achieved or continuous monitoring to identify malicious code at rest.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":593,"title":"SC.3.183","description":"<div>Deny network communications traffic by default and allow network communications traffic by exception (i.e. deny all, permit by exception).</div><div><br></div><div>This requirement applies to inbound and outbound network communications traffic at the system boundary and at identified points within the system. A deny-all, permit-by—exception network communications traffic policy ensures that only those connections which are essential and approved are allowed.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Communications Protection (SC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":594,"title":"SI.5.222","description":"<div>Analyze system behavior to detect and mitigate execution of normal system commands and scripts that indicate malicious actions.</div><div><br></div><div>Organizations deploy preventive measures such as anti—Virus or application whitelisting to reduce the effects of malware executables on endpoints. As the use of whitelisting becomes a more pervasive defense technique attackers are leveraging trusted operating systems software, scripts, or code to perform malicious activities including lateral movement and persistence. By using these tactics, the attacker seeks to reduce the chances of being discovered. This move to \"living off the land\" needs to be mitigated by analyzing the use and behavior of system commands and utilities.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":595,"title":"IR.4.101","description":"<div>Establish and maintain a security operations center capability that facilitates a 24/7 response capability.</div><div><br></div><div>A security operations center (SOC) is the focal point for security operations and computer network defense for an organization. The purpose of the SOC is to defend and monitor an organization’s systems and networks (i.e., cyber infrastructure) on an ongoing basis. The SOC is also responsible for detecting, analyzing, and responding to cybersecurity incidents in a timely manner. The SOC is staffed with skilled technical and operational personnel (e.g., security analysts, incident response personnel, systems security engineers); and implements technical, management, and operational controls (including monitoring, scanning, and forensics tools) to monitor, fuse, correlate, analyze, and respond to threat and security-relevant event data from multiple sources. Sources include perimeter defenses, network devices (e.g., gateways, routers, switches) and endpoint agent data feeds. The SOC provides a holistic situational awareness capability to help organizations determine the security posture of the system and organization. A SOC capability can be obtained in a variety of ways. Larger organizations may implement a dedicated SOC while smaller organizations may employ third-party organizations to provide such capability.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":596,"title":"IR.3.099","description":"<div>Test the organizational incident response capability.</div><div><br></div><div>Organizations test incident response capabilities to determine the effectiveness of the capabilities and to identify potential weaknesses or deficiencies. Incident response testing includes the use of checklists, walk-through or tabletop exercises, simulations (both parallel and full interrupt), and comprehensive exercises. Incident response testing can also include a determination of the effects on organizational operations (e.g., reduction in mission capabilities), organizational assets, and individuals due to incident response.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":597,"title":"AC.4.025","description":"<div>Periodically review and update CUI program access permissions.</div><div><br></div><div>Organizations must maintain the authorizations for access to CUI information on a regular basis, considering whether existing authorizations are still needed or new authorization are required, and update the authorizations accordingly. Reviews of access take into consideration mission/business needs and maintain the organization’s implementation of the principle of least privilege.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":598,"title":"AC.4.032","description":"Restrict remote network access based on organizationally defined risk factors such as time of day, location of access, physical location, network connection state, and measured properties of the current user and role.<div><br></div><div>This practice adds additional granularity to remote access restrictions based upon organization-determined factors. The example factors in the practice are provided to help explain the meaning of ‘risk factors’ as anything that adds additional context to be considered in a determination of whether to grant remote access.&nbsp;</div><div><br></div><div>The intent of this practice is to define additional context for allowed remote access and then to enforce Via technical, versus just policy, means.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":599,"title":"AC.5.024","description":"<div>Identify and mitigate risk associated with unidentified wireless access points connected to the network.</div><div><br></div><div>Unidentified and unauthorized wireless access points can be connected to a network by authorized users trying to extend the network or by malicious users. They may allow unauthorized users direct access to an organization’s network. In either case they represent a cybersecurity vulnerability. Organizations must mitigate this vulnerability.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":600,"title":"AM.3.036","description":"<div>Define procedures for the handling of CUI data.</div><div><br></div><div>The organization should define procedures for the proper handling of CUI. These procedures typically involve establishing controls to protect and sustain sensitive information. Examples of controls an organization may implement through data handling procedures include policies [data categorization, protection, disposal, backup), access controls for data, regular backups and physical security protections.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Asset Management (AM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":601,"title":"AM.4.226","description":"<div>Employ a capability to discover and identify systems with specific component attributes (e.g., firmware level, OS type) within your inventory.</div><div><br></div><div>Organizations employ systems that can assess assets connected to the network in real time, or can create an inventory identifying system-specific information required for component accountability and to provide support to identify, control, monitor, and verify configuration items in accordance with the authoritative source. For user computing systems this should include: firmware level, OS type, drive type, network and wireless card vendors, monitor card type and vendor, and software applications installed on that system.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Asset Management (AM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":602,"title":"AT.2.056","description":"<div>Ensure that managers, system administrators, and users of organizational systems are made aware of the security risks associated with their activities and of the applicable policies, standards, and procedures related to the security of those systems.</div><div><br></div><div>Organizations determine the content and frequency of security awareness training and security awareness techniques based on the specific organizational requirements and the systems to which personnel have authorized access. The content includes a basic understanding of the need for information security and user actions to maintain security and to respond to suspected security incidents. The content also addresses awareness of the need for operations security. Security awareness techniques include: formal training; offering supplies inscribed with security reminders; generating email advisories or notices from organizational officials; displaying logon screen messages; displaying security awareness posters; and conducting information security awareness events.&nbsp;</div><div><br></div><div>NIST SP 800-50 provides guidance on security awareness and training programs.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Awareness and Training (AT)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":603,"title":"AT.2.057","description":"<div>Ensure that personnel are trained to carry out their assigned information security-related duties and responsibilities.</div><div><br></div><div>Organizations determine the content and frequency of security training based on the assigned duties, roles, and responsibilities of individuals and the security requirements of organizations and the systems to which personnel have authorized access. In addition, organizations provide system developers, enterprise architects, security architects, acquisition /procurement officials, software developers, system developers, systems integrators, system/network administrators, personnel conducting configuration management and auditing activities, personnel performing independent verification and validation, security assessors, and other personnel having access to system-level software, security-related technical training specifically tailored for their assigned duties.&nbsp;</div><div><br></div><div>Comprehensive role-based training addresses management, operational, and technical roles and responsibilities covering physical, personnel, and technical controls. Such training can include policies, procedures, tools, and artifacts for the security roles defined. Organizations also provide the training necessary for individuals to carry out their responsibilities related to operations and supply chain security within the context of organizational information security programs.&nbsp;</div><div><br></div><div>NIST SP 800-181 provides guidance on role-based information security training in the workplace. SP 800-161 provides guidance on supply chain risk management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Awareness and Training (AT)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":604,"title":"AT.3.058","description":"<div>Provide security awareness training on recognizing and reporting potential indicators of insider threat.</div><div><br></div><div>Potential indicators and possible precursors of insider threat include behaviors such as: inordinate, long-term job dissatisfaction; attempts to gain access to information that is not required for job performance; unexplained access to financial resources; bullying or sexual harassment of fellow employees; workplace violence; and other serious violations of the policies, procedures, directives, rules, or practices of organizations. Security awareness training includes how to communicate employee and management concerns regarding potential indicators of insider threat through appropriate organizational channels in accordance with established organizational policies and procedures. Organizations may consider tailoring insider threat awareness topics to the role (e.g., training for managers may be focused on specific changes in behavior of team members, while training for employees may be focused on more general observations).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Awareness and Training (AT)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":605,"title":"AT.4.059","description":"<div>Provide awareness training focused on recognizing and responding to threats from social engineering, advanced persistent threat actors, breaches, and suspicious behaviors; update the training at least annually or when there are significant changes to the threat.</div><div><br></div><div>One of the most effective ways to detect APT activities and to reduce the effectiveness of those activities is to provide specific awareness training for individuals. A well-trained and security aware workforce provides another organizational safeguard that can be employed as part of a defense- in-depth strategy to protect organizations against malicious code injections via email or the web applications. Threat awareness training includes educating individuals on the various ways APTs can infiltrate into organizations including through websites, emails, advertisement pop-ups, articles, and social engineering. Training can include techniques for recognizing suspicious emails, the use of removable systems in non— secure settings, and the potential targeting of individuals by adversaries outside the workplace. Awareness training is assessed and updated periodically to ensure that the training is relevant and effective, particularly with respect to the threat since it is constantly, and often rapidly, evolving.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Awareness and Training (AT)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":606,"title":"AT.4.060","description":"<div>Include practical exercises in awareness training that are aligned with current threat scenarios and provide feedback to individuals involved in the training.</div><div><br></div><div>Awareness training is most effective when it is complemented by practical exercises tailored to the tactics, techniques, and procedures (TTPs) of the threat. Examples of practical exercises include no-notice social engineering attempts to gain unauthorized access, collect information, or simulate the adverse impact of opening malicious email attachments or invoking, via spear phishing attacks, malicious web links. Rapid feedback is essential to reinforce desired user behavior. Training results, especially failures of personnel in critical roles, can be indicative of a potential serious problem. [Modified only to remove requirement to notify supervisors from NIST SP 800-17 1B 3.2.2e].<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Awareness and Training (AT)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":607,"title":"AU.2.041","description":"<div>Ensure that the actions of individual system users can be uniquely traced to those users so they can be held accountable for their actions.</div><div><br></div><div>This requirement ensures that the contents of the audit record include the information needed to link the audit event to the actions of an individual to the extent feasible. Organizations consider logging for traceability including results from monitoring of account usage, remote access, wireless connectivity, mobile device connection, communications at system boundaries, configuration settings, physical access, non-local maintenance, use of maintenance tools, temperature and humidity, equipment delivery and removal, system component inventory, use of mobile code, and use of VoIP.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":608,"title":"AU.2.042","description":"<div>Create and retain system logs and records to the extent needed to enable the monitoring, analysis, investigation, and reporting of unlawful or unauthorized system activity.</div><div><br></div><div>An event is any observable occurrence in a system, which includes unlawful or unauthorized system activity. Organizations identify event types for which a logging functionality is needed as those events which are significant and relevant to the security of systems and the environments in which those systems operate to meet specific and ongoing auditing needs. Event types can include password changes, failed logons or failed accesses related to systems, administrative privilege usage, or third-party credential usage. In determining event types that require logging, organizations consider the monitoring and auditing appropriate for each of the GUI security requirements. Monitoring and auditing requirements can be balanced with other system needs. For example, organizations may determine that systems must have the capability to log every file access both successful and unsuccessful, but not activate that capability except for specific circumstances due to the potential burden on system performance.&nbsp;</div><div><br></div><div>&nbsp;Audit records can be generated at various levels of abstraction, including at the packet level as information traverses the network. Selecting the appropriate level of abstraction is a critical aspect of an audit logging capability and can facilitate the identification of root causes to problems. Organizations consider in the definition of event types, the logging necessary to cover related events such as the steps in distributed, transaction-based processes (e.g., processes that are distributed across multiple organizations) and actions that occur in service-oriented or cloud-based architectures.&nbsp;</div><div><br></div><div>&nbsp;Audit record content that maybe necessary to satisfy this requirement includes time stamps, source and destination addresses, user or process identifiers, event descriptions, success or failure indications, filenames involved, and access control or flow control rules invoked. Event outcomes can include indicators of event success or failure and event-specific results (e.g., the security state of the system after the event occurred).&nbsp;</div><div><br></div><div>Detailed information that organizations may consider in audit records includes full text recording of privileged commands or the individual identities of group account users. Organizations consider limiting the additional audit log information to only that information explicitly needed for specific audit requirements. This facilitates the use of audit trails and audit logs by not including information that could potentially be misleading or could make it more difficult to locate information of interest. Audit logs are reviewed and analyzed as often as needed to provide important information to organizations to facilitate risk-based decision making. NIST SP 800-92 provides guidance on security log management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":609,"title":"AU.2.043","description":"<div>Provide a system capability that compares and synchronizes internal system clocks with an authoritative source to generate time stamps for audit records.</div><div><br></div><div>Internal system clocks are used to generate time stamps, which include date and time. Time is expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC. The granularity of time measurements refers to the degree of synchronization between system clocks and reference clocks, for example, clocks synchronizing within hundreds of milliseconds or within tens of milliseconds. Organizations may define different time granularities for different system components. Time service can also be critical to other security capabilities such as access control and identification and authentication, depending on the nature of the mechanisms used to support those capabilities. This requirement provides uniformity of time stamps for systems with multiple system clocks and systems connected over a network.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":610,"title":"AU.2.044","description":"<div>Review audit logs.</div><div><br></div><div>Reviewing audit logs is a common control in information security. Organizations have the flexibility to determine which logs and specific events to review. The level of audit log review should be determined based on a risk assessment or similar activity.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":611,"title":"AU.3.045","description":"<div>Review and update logged events.</div><div><br></div><div>Periodically re-evaluate which events are logged and which events should be added, modified, or deleted. The event types that are logged by organizations may change over time. Reviewing and up dating the set of logged event types periodically is necessary to ensure that the current set remains necessary and sufficient.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":612,"title":"AU.3.046","description":"<div>Alert in the event of an audit logging process failure.</div><div><br></div><div>Audit logging process failures include software and hardware errors, failures in the audit record capturing mechanisms, and audit record storage capacity being reached or exceeded. This requirement applies to each audit record data storage repository (i.e., distinct system component where audit records are stored), the total audit record storage capacity of organizations (i.e., all audit record data storage repositories combined), or both.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":613,"title":"AU.3.048","description":"<div>Collect audit information (e.g., logs) into one or more central repositories.</div><div><br></div><div>Aggregate and store audit logs in a central location. Central repositories enable analysis by storing audit record content needed for analysis in a common location and format. Storing audit logs in central repositories also protects audit information. The repository has the available infrastructure, capacity, and protection mechanisms to meet the organization’s audit requirements. Policy and local laws may place requirements on the location and structure of the repositories.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":614,"title":"AC.4.023","description":"<div>Control information flows between security domains on connected systems.</div><div><br></div><div>Organizations employ information flow control policies and enforcement mechanisms to control the flow of information between designated sources and destinations within systems and between connected systems. Flow control is based on the characteristics of the information and/or the information&nbsp;path. Enforcement occurs, for example, in boundary protection devices that employ rule sets or establish configuration settings that restrict system services; provide a packet-filtering capability based on header information; or provide message—filtering capability based on message content.&nbsp;</div><div><br></div><div>Transferring information between systems in different security domains with different security policies introduces risk that the transfers violate one or more domain security policies. In such situations, information owners or stewards provide guidance at designated policy enforcement points between connected systems. Organizations mandate specific architectural solutions when required to enforce logical or physical separation between systems in different security domains. Enforcement includes prohibiting information&nbsp;transfers between connected systems; employing hardware mechanisms to enforce one—way information&nbsp;flows; and verifying write permissions before accepting information from another security domain or connected system.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":615,"title":"AC.3.022","description":"<div>Encrypt CUI on mobile devices and mobile computing platforms.</div><div><br></div><div>Organizations can employ full-device encryption or container—based encryption to protect the confidentiality of CUI on mobile devices and computing platforms. Container—based encryption provides a more fine-grained approach to the encryption of data and information including encrypting selected data structures such as files, records, or fields. Protecting cryptographic keys is an essential element of any encryption solution.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":616,"title":"AC.3.021","description":"<div>Authorize remote execution of privileged commands and remote access to security-relevant information.</div><div><br></div><div>A privileged command is a human—initiated [interactively or via a process operating on behalf of the human) command executed on a system involving the control, monitoring, or administration of the system including security functions and associated security-relevant information. Security-relevant information is any information within the system that can potentially impact the operation of security functions or the provision of security services in a manner that could result in failure to enforce the system security policy or maintain isolation of code and data. Privileged commands give individuals the ability to execute sensitive, security-critical, or security-relevant system functions. Controlling such access from remote locations helps to ensure that unauthorized individuals are not able to execute such commands freely with the potential to do serious or catastrophic damage to organizational systems. Note that the ability to affect the integrity of the system is considered security-relevant as that could enable the means to by-pass security functions although not directly impacting the function itself.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":617,"title":"AC.3.020","description":"<div>Control connection of mobile devices.</div><div><br></div><div>A mobile device is a computing device that has a small form factor such that it can easily be carried by a single individual; is designed to operate without a physical connection (e.g., wirelessly transmit or receive information); possesses local, non-removable or removable data storage; and includes a self—contained power source. Mobile devices may also include voice communication capabilities, on-board sensors that allow the device to capture information, or built—in features for synchronizing local data with remote locations. Examples of mobile devices include smart phones, e—readers, and tablets.&nbsp;</div><div><br></div><div>&nbsp;Due to the large variety of mobile devices with different technical characteristics and capabilities, organizational restrictions may vary for the different types of devices. Usage restrictions and implementation guidance for mobile devices include: device identification and authentication; configuration management; implementation of mandatory protective software (e.g., malicious code detection, firewall); scanning devices for malicious code; updating virus protection software; scanning for critical software updates and patches; conducting primary operating system (and possibly other resident software) integrity checks; and disabling unnecessary hardware [e.g., wireless, infrared). The need to provide adequate security for mobile devices goes beyond this requirement. Many controls for mobile devices are reflected in other CUI security requirements.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":618,"title":"AC.1.002","description":"Limit information system access to the types of transactions and functions that authorized users are permitted to execute.<div><br></div><div>Organizations may choose to define access privileges or other attributes by account, by type of account, or a combination of both. System account types include individual, shared, group, system, anonymous, guest, emergency, developer, manufacturer, vendor, and temporary. Other attributes required for authorizing access include restrictions on time-of—day, day-of- Week, and point-of -origin. In defining other account attributes, organizations consider system-related requirements [e.g., system upgrades scheduled maintenance,) and mission or business requirements, (e.g., time zone differences, customer requirements, remote access to support travel requirements).<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":619,"title":"AC.1.003","description":"<div>Verify and control/limit connections to and use of external information systems.</div><div><br></div><div>External systems are systems or components of systems for which organizations typically have no direct supervision and authority over the application of security requirements and controls or the determination of the effectiveness of implemented controls on those systems. External systems include personally owned systems, components, or devices and privately- owned computing and communications devices resident in commercial or public facilities. This requirement also addresses the use of external systems for the processing, storage, or transmission of Federally Contracted Information, including accessing cloud services (e.g., infrastructure as a service, platform as a service, or software as a service) from organizational systems.  Organizations establish terms and conditions for the use of external systems in accordance with organizational security policies and procedures. Terms and conditions address as a minimum, the types of applications that can be accessed on organizational systems from external systems. If terms and conditions with the owners of external systems cannot be established, organizations may impose restrictions on organizational personnel using those external systems.  This requirement recognizes that there are circumstances where individuals using external systems [e.g., contractors, coalition partners) need to access organizational systems. In those situations, organizations need confidence that the external systems contain the necessary controls so as not to compromise, damage, or otherwise harm organizational systems. Verification that the required controls have been effectively implemented can be achieved by third-party, independent assessments, attestations, or other means, depending on the assurance or confidence level required by organizations.  Note that while \"external\" typically refers to outside of the organization’s direct supervision and authority, that is not always the case. Regarding the protection of Federally Contracted Information across an organization, the organization may have systems that process Federally Contracted Information and others that do not. And among the systems that process Federally Contracted Information there are likely access restrictions for Federally Contracted Information that apply between systems. Therefore, from the perspective of a given system, other systems within the organization may be considered “external\" to that system.<br><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":620,"title":"AC.1.004","description":"<div>Control information posted or processed on publicly accessible information systems.</div><div><br></div><div>In accordance With laws, Executive Orders, directives, policies, regulations, or standards, the public is not authorized access to nonpublic information [e.g., information protected under the Privacy Act, GUI, and proprietary information). This requirement addresses systems that are controlled by the organization and accessible to the public, typically without identification or authentication. Individuals authorized to post CUI onto publicly accessible systems are designated. The content of information is reviewed prior to posting onto publicly accessible systems to ensure that nonpublic information is not included.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":621,"title":"AC.2.005","description":"<div>Provide privacy and security notices consistent with applicable CUI rules.</div><div><br></div><div>System use notifications can be implemented using messages or warning banners displayed before individuals log in to organizational systems. System use notifications are used only for access via logon interfaces with human users and are not required when such human interfaces do not exist. Based on a risk assessment, organizations consider whether a secondary system use notification is needed to access applications or other system resources after the initial network logon. Where necessary, posters or other printed materials may be used in lieu of an automated system banner. Organizations consult with the Office of General Counsel for legal review and approval of warning banner content.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":622,"title":"AC.2.006","description":"<div>Limit use of portable storage devices on external systems.</div><div><br></div><div>Limits on the use of organization-controlled portable storage devices in external systems include complete prohibition of the use of such devices or restrictions on 110w the devices may be used and under what conditions the devices may be used. Note that while \"external” typically refers to outside of the organization’s direct supervision and authority that is not always the case. Regarding the protection of CUI across an organization, the organization may have systems that process CUI and others that do not. Among the systems that process CUI there are likely access restrictions for GUI that apply between systems. Therefore, from the perspective of a given system, other systems within the organization may be considered “external\" to that system.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":623,"title":"AC.2.007","description":"<div>Employ the principle of least privilege, including for specific security functions and privileged accounts.</div><div><br></div><div>Organizations employ the principle of least privilege for specific duties and authorized accesses for users and processes. The principle of least privilege is applied with the goal of authorized privileges no higher than necessary to accomplish required organizational missions or business functions. Organizations consider the creation of additional processes, roles, and system accounts as necessary, to achieve least privilege. Organizations also apply least privilege to the development, implementation, and operation of organizational systems. Security functions include establishing system accounts, setting events to be logged, setting intrusion detection parameters, and configuring access authorizations [i.e., permissions, privileges).  Privileged accounts, including super user accounts, are typically described as system administrator for various types of commercial off—the-shelf operating systems. Restricting privileged accounts to specific personnel or roles prevents day-to-day users from having access to privileged information or functions. Organizations may differentiate in the application of this requirement between allowed privileges for local accounts and for domain accounts provided organizations retain the ability to control system configurations for key security parameters and as otherwise necessary to sufficiently mitigate risk.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":624,"title":"AC.2.008","description":"<div>Use non-privileged accounts or roles when accessing non-security functions.</div><div><br></div><div>This requirement limits exposure when operating from within privileged accounts or roles. The inclusion of roles addresses situations where organizations implement access control policies such as role—based access control and where a change of role provides the same degree of assurance in the change of access authorizations for the user and all processes acting on behalf of the user as would be provided by a change between a privileged and non— privileged account.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":625,"title":"AC.2.009","description":"<div>Limit unsuccessful logon attempts.</div><div><br></div><div>This requirement applies regardless of whether the logon occurs Via a local or network connection. Due to the potential for denial of service, automatic lockouts initiated by systems are, in most cases, temporary and automatically release after a predetermined period established by the organization [i.e., a delay algorithm). If a delay algorithm is selected, organizations may employ different algorithms for different system components based on the capabilities of the respective components. Responses to unsuccessful logon attempts may be implemented at the operating system and application levels.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":626,"title":"AU.3.049","description":"<div>Protect audit information and audit logging tools from unauthorized access, modification, and deletion.</div><div><br></div><div>Audit information includes all information (e.g., audit records, audit log settings, and audit reports) needed to successfully audit system activity. Audit logging tools are those programs and devices used to conduct audit and logging activities. This requirement focuses on the technical protection of audit information and limits the ability to access and execute audit logging tools to authorized individuals. Physical protection of audit information is addressed by media protection and physical and environmental protection requirements.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":627,"title":"AC.2.010","description":"<div>Use session lock with pattern-hiding displays to prevent access and viewing of data after a period of inactivity.</div><div><br></div><div>Session locks are temporary actions taken when users stop work and move away from the immediate Vicinity of the system but do not want to log out because of the temporary nature of their absences. Session locks are implemented where session activities can be determined, typically at the operating system level [but can also be at the application level). Session locks are not an acceptable substitute for logging out of the system, for example, if organizations require users to log out at the end of the workday.  Pattern-hiding displays can include static or dynamic images, for example, patterns used with screen savers, photographic images, solid colors, clock, battery life indicator, or a blank screen, with the additional caveat that none of the images convey controlled unclassified information.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":628,"title":"AC.2.013","description":"<div>Monitor and control remote access sessions.</div><div><br></div><div>Remote access is access to organizational systems by users (or processes acting on behalf of users) communicating through external networks (e.g., the Internet). Remote access methods include dial—up, broadband, and wireless. Organizations often employ encrypted virtual private networks [VPNs) to enhance confidentiality over remote connections. The use of encrypted VPNs does not make the access non—remote; however, the use of VPNs, when adequately provisioned with appropriate control [e.g., employing encryption techniques for confidentiality protection), may provide sufficient assurance to the organization that it can effectively treat such connections as internal networks. VPNs with encrypted tunnels can affect the capability to adequately monitor network communications traffic for malicious code.  Automated monitoring and control of remote access sessions allows organizations to detect cyber—attacks and help to ensure ongoing compliance with remote access policies by auditing connection activities of remote users on a variety of system components [e.g., servers, workstations, notebook computers, smart phones, and tablets).  NIST SP 800-46, SP 800-77, and SP 800-113 provide guidance on secure remote access and virtual private networks.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":629,"title":"AC.2.015","description":"<div>Route remote access via managed access control points.</div><div><br></div><div>Routing remote access through managed access control points enhances explicit, organizational control over such connections, reducing the susceptibility to unauthorized access to organizational systems resulting in the unauthorized disclosure of CUI.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":630,"title":"AC.2.016","description":"<div>Control the flow of CUI in accordance with approved authorizations.</div><div><br></div><div>Information flow control regulates where information can travel within a system and between systems (versus who can access the information) and without explicit regard to subsequent accesses to that information. Flow control restrictions include the following: keeping export—controlled information from being transmitted in the clear to the Internet; blocking outside traffic that claims to be from within the organization; restricting requests to the Internet that are not from the internal web proxy server; and limiting information transfers between organizations based on data structures and content.&nbsp;</div><div><br></div><div>&nbsp;Organizations commonly use information flow control policies and enforcement mechanisms to control the flow of information between designated sources and destinations (e.g., networks, individuals, and devices) within systems and between interconnected systems. Flow control is based on characteristics of the information or the information path. Enforcement occurs in boundary protection devices (e.g., gateways, routers, guards, encrypted tunnels, firewalls) that employ rule sets or establish configuration settings that restrict system services, provide a packet-filtering capability based on header information, or message—filtering capability based on message content (e.g., implementing key word searches or using document characteristics). Organizations also consider the trustworthiness of filtering and inspection mechanisms (i.e., hardware, firmware, and software components) that are critical to information flow enforcement.&nbsp;</div><div><br></div><div>&nbsp;Transferring information between systems representing different security domains with different security policies introduces risk that such transfers violate one or more domain security policies.&nbsp;</div><div><br></div><div>Organizations consider the shared nature of commercial telecommunications services in the implementation of security requirements associated with the use of such services. Commercial telecommunications services are commonly based on network components and consolidated management systems shared by all attached commercial customers and may also include third party-provided access lines and other service elements. Such transmission services may represent sources of increased risk despite contract security provisions. NIST SP 800-41 provides guidance on firewalls and firewall policy. SP 800-1258 provides guidance on security for virtualization technologies.&nbsp;</div><div><br></div><div>In such situations, information owners or stewards provide guidance at designated policy enforcement points between interconnected systems. Organizations consider mandating specific architectural solutions when required to enforce specific security policies. Enforcement includes: prohibiting information transfers between interconnected systems (i.e., allowing access only) ; employing hardware mechanisms to enforce one-way information flows; and implementing trustworthy regrading mechanisms to reassign security attributes and security labels.<br></div><div><div><br></div><div>Flow control regulates where and how information can flow. Firewalls and proxy servers can be used to control traffic flow. Typically, organizations will have a firewall between the internal network and the internet. Often multiple firewalls are used inside a network to create zones to separate sensitive data, business units or user groups. Proxy servers can be used to break the connection between multiple networks. All traffic entering or leaving a network is intercepted by the proxy, preventing direct access between networks. This can have security and performance benefits. Additionally, organizations should ensure that all sensitive information is encrypted before being transmitted over the internet.<br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":631,"title":"AC.3.012","description":"<div>Protect wireless access using authentication and encryption.</div><div><br></div><div>Organizations authenticate individuals and devices to help protect wireless access to the system. Special attention is given to the wide variety of devices that are part of the Internet of Things with potential wireless access to organizational systems.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":632,"title":"AC.3.014","description":"<div>Employ cryptographic mechanisms to protect the confidentiality of remote access sessions.</div><div><br></div><div>Cryptographic standards include FIPS-validated cryptography and NSA-approved cryptography.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":633,"title":"AC.3.017","description":"<div>Separate the duties of individuals to reduce the risk of malevolent activity without collusion</div><div><br></div><div>Separation of duties addresses the potential for abuse of authorized privileges and helps to reduce the risk of malevolent activity Without collusion. Separation of duties includes dividing mission functions and system support functions among different individuals or roles; conducting system support functions with different individuals (e.g., configuration management, quality assurance and testing, system management, programming, and network security); and ensuring that security personnel administering access control functions do not also administer audit functions. Because separation of duty violations can span systems and application domains, organizations consider the entirety of organizational systems and system components when developing policy on separation of duties.<br></div><div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":634,"title":"AC.3.018","description":"<div>Prevent non-privileged users from executing privileged functions and capture the execution of such functions in audit logs.</div><div><br></div><div>Privileged functions include establishing system accounts, performing system integrity checks, conducting patching operations, or administering cryptographic key management activities. Non-privileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users. Note that this requirement represents a condition to be achieved by the definition of authorized privileges in 3.1.2 (AC.1.002).&nbsp;</div><div><br></div><div>Misuse of privileged functions, either intentionally or unintentionally by authorized users, or by unauthorized external entities that have compromised system accounts, is a serious and ongoing concern and can have significant adverse impacts on organizations. Logging the use of privileged functions is one way to detect such misuse, and in doing so, help mitigate the risk from insider threats and the advanced persistent threat.<br></div><div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":635,"title":"AC.3.019","description":"<div>Terminate (automatically) user sessions after a defined condition.</div><div><div><br></div></div><div>This requirement addresses the termination of user-initiated logical sessions in contrast to the termination of network connections that are associated with communications sessions (i.e., disconnecting from the network). A logical session (for local, network, and remote access) is initiated whenever a user [or process acting on behalf of a user) accesses an organizational system. Such user sessions can be terminated (and thus terminate user access) without terminating network sessions. Session termination terminates all processes associated with a user’s logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated. Conditions or trigger events requiring automatic session termination can include organization-defined periods of user inactivity, targeted responses to certain types of incidents, and time-of—day restrictions on system use.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":636,"title":"AC.2.011","description":"<div>Authorize wireless access prior to allowing such connections.</div><div><br></div><div>Establishing usage restrictions and configuration/connection requirements for wireless access to the system provides criteria for organizations to support wireless access authorization decisions. Such restrictions and requirements reduce the susceptibility to unauthorized access to the system through wireless technologies. Wireless networks use authentication protocols which provide credential protection and mutual authentication.<br></div><div><div><br></div><div><br></div></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Access Control (AC)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":637,"title":"IR.4.100","description":"<div>Use knowledge of attacker tactics, techniques, and procedures in incident response planning and execution.</div><div><br></div><div>This practice requires that an organization explicitly consider the attacker’s perspective in implementing the organization’s incident response capability. The information necessary to do so can be from public sources, from government, or from third-party threat intelligence organizations. Specially, it is not the intent of this practice to require an internal, organizational threat intelligence capability. See practice RM.4.149 for the creation of this information.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":638,"title":"AU.3.050","description":"<div>Limit management of audit logging functionality to a subset of privileged users.</div><div><br></div><div>Individuals with privileged access to a system and who are also the subject of an audit by that system, may affect the reliability of audit information by inhibiting audit logging activities or modifying audit records. This requirement specifies that privileged access be further defined between audit—related privileges and other privileges, thus limiting the users with audit-related privileges.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":639,"title":"AU.3.052","description":"<div>Provide audit record reduction and report generation to support on-demand analysis and reporting.</div><div><br></div><div>Audit record reduction is a process that manipulates collected audit information and organizes such information in a summary format that is more meaningful to analysts. Audit record reduction and report generation capabilities do not always emanate from the same system or organizational entities conducting auditing activities. Audit record reduction capability can include, for example, modern data mining techniques with advanced data filters to identify anomalous behavior in audit records. The report generation capability provided by the system can help generate customizable reports. Time ordering of audit records can be a significant issue if the granularity of the time stamp in the record is insufficient.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":640,"title":"IA.1.076","description":"<div>Identify information system users, processes acting on behalf of users, or devices.</div><div><br></div><div>Common device identifiers include media access control (MAC), Internet protocol (IP) addresses, or device-unique token identifiers. Management of individual identifiers is not applicable to shared system accounts. Typically, individual identifiers are the user names associated with the system accounts assigned to those individuals. Organizations may require unique identification of individuals in group accounts or for detailed accountability of individual activity. In addition, this requirement addresses individual identifiers that are not necessarily associated with system accounts. Organizational devices requiring identification may be defined by type, by device, or by a combination of type / device. NIST SP 800-63-3 provides guidance on digital identities.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":641,"title":"IA.1.077","description":"<div>Authenticate (or verify) the identities of those users, processes, or devices, as a prerequisite to allowing access to organizational information systems.</div><div><br></div><div>Individual authenticators include the following: passwords, key cards, cryptographic devices, and one-time password devices. Initial authenticator content is the actual content of the authenticator, for example, the initial password. In contrast, the requirements about authenticator content include the minimum password length. Developers ship system components with factory default authentication credentials to allow for initial installation and configuration. Default authentication credentials are often well known, easily discoverable, and present a significant security risk.&nbsp;</div><div><br></div><div>Systems support authenticator management by organization-defined settings and restrictions for various authenticator characteristics including minimum password length, validation time Window for time synchronous one-time tokens, and number of allowed rejections during the verification stage of biometric authentication. Authenticator management includes issuing and revoking, when no longer needed, authenticators for temporary access such as that required for remote maintenance. Device authenticators include certificates and passwords.&nbsp;</div><div><br></div><div>NIST SP 800-63-3 provides guidance on digital identities.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 1 - Basic Cyber Hygiene","tenantsId":1},{"id":642,"title":"IA.2.078","description":"<div>Enforce a minimum password complexity and change of characters when new passwords are created.</div><div><br></div><div>This requirement applies to single—factor authentication of individuals using passwords as individual or group authenticators. and in a similar manner, when passwords are used as part of multifactor authenticators. The number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. To mitigate certain brute force attacks against passwords, organizations may also consider salting passwords.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":643,"title":"IA.2.079","description":"<div>Prohibit password reuse for a specified number of generations.</div><div><br></div><div>Password lifetime restrictions do not apply to temporary passwords.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":644,"title":"IA.2.080","description":"<div>Allow temporary password use for system logons with an immediate change to a permanent password.</div><div><br></div><div>Changing temporary passwords to permanent passwords immediately after system logon ensures that the necessary strength of the authentication mechanism is implemented at the earliest opportunity, reducing the susceptibility to authenticator compromises.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":645,"title":"IA.2.081","description":"<div>Store and transmit only cryptographically-protected passwords.</div><div><br></div><div>Cryptographically-protected passwords use salted one-way cryptographic hashes of passwords.&nbsp;</div><div><br></div><div>See NIST Cryptographic Standards and Guidelines.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":646,"title":"IA.2.082","description":"<div>Obscure feedback of authentication information.</div><div><br></div><div>The feedback from systems does not provide any information that would allow unauthorized individuals to compromise authentication mechanisms. For some types of systems or system components, for example, desktop or notebook computers with relatively large monitors, the threat (often referred to as shoulder surfing) may be significant. For other types of systems or components, for example, mobile devices with small displays, this threat may be less significant, and is balanced against the increased likelihood of typographic input errors due to the small keyboards. Therefore, the means for obscuring the authenticator feedback is selected accordingly. Obscuring authenticator feedback includes displaying asterisks when users type passwords into input devices or displaying feedback for a very limited time before fully obscuring it.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":647,"title":"IA.3.083","description":"<div>Use multifactor authentication for local and network access to privileged accounts and for network access to non-privileged accounts.</div><div><br></div><div>Multifactor authentication requires the use of two or moredifferent factors to authenticate. The factors are defined as something you know (e.g., password, personal identification number [PIN]); something you have (e.g., cryptographic identification device, token); or something you are (e.g., biometric). Multifactor authentication solutions that feature physical authenticators include hardware authenticators providing time-based or challenge- response authenticators and smart cards. In addition to authenticating users at the system level (i.e., at logon), organizations may also employ authentication mechanisms at the application level, when necessary, to provide increased information security. Access to organizational systems is defined as local access or network access. Local access is any access to organizational systems by users (or processes acting on behalf of users) where such access is obtained by direct connections without the use of networks. Network access is access to systems by users (or processes acting on behalf of users) where such access is obtained through network connections (i.e., nonlocal accesses). Remote access is a type of network access that involves communication through external networks. The use of encrypted virtual private networks for connections between organization-controlled and non-organization controlled endpoints may be treated as internal networks with regard to protecting the confidentiality of information.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":648,"title":"IA.3.084","description":"<div>Employ replay-resistant authentication mechanisms for network access to privileged and non-privileged accounts.</div><div><br></div><div>Authentication processes resist replay attacks if it is impractical to successfully authenticate by recording or replaying previous authentication messages. Replay-resistant techniques include protocols that use noncesor challenges such as time synchronous or challenge-response one-time authenticator.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":649,"title":"IA.3.085","description":"<div>Prevent the reuse of identifiers for a defined period.</div><div><br></div><div>Identifiers are provided for users, processes acting on behalf of users, or devices (IA.1.076). Preventing reuse of identifiers implies preventing the assignment of previously used individual, group, role, or device identifiers to different individuals, groups, roles, or devices.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":650,"title":"IA.3.086","description":"<div>Disable identifiers after a defined period of inactivity.</div><div><br></div><div>Inactive identifiers pose a risk to organizational information because attackers may exploit an inactive identifier to gain undetected access to organizational devices. The owners of the inactive accounts may not notice if unauthorized access to the account has been obtained.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Identification and Authentication (IA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":651,"title":"IR.2.092","description":"<div>Establish an operational incident-handling capability for organizational systems that includes preparation, detection, analysis, containment, recovery, and user response activities.</div><div><br></div><div>Organizations recognize that incident handling capability is dependent on the capabilities of organizational systems and the mission/business processes being supported by those systems. Organizations consider incident handling as part of the definition, design, and development of mission/business processes and systems. Incident-related information can be obtained from a variety of sources including audit monitoring, network monitoring, physical access monitoring, user and administrator reports, and reported supply chain events. Effective incident handling capability includes coordination among many organizational entities including mission/business owners, system owners, authorizing officials, human resources offices, physical and personnel security offices, legal departments, operations personnel, procurement offices, and the risk executive.&nbsp;</div><div><br></div><div>As part of user response activities, incident response training is provided by organizations and is linked directly to the assigned roles and responsibilities of organizational personnel to ensure that the appropriate content and level of detail is included in such training. For example, regular users may only need to know who to call or how to recognize an incident on the system; system administrators may require additional training on how to handle or remediate incidents; and incident responders may receive more specific training on forensics, reporting, system recovery, and restoration. Incident response training includes user training in the identification/reporting of suspicious activities from external and internal sources. User response activities also includes incident response assistance which may consist of help desk support, assistance groups, and access to forensics services or consumer redress services, when required.&nbsp;</div><div><br></div><div>NIST SP 800-61 provides guidance on incident handling. SP 800-86 and SP 800-101 provide guidance on integrating forensic techniques into incident response. SP 800-161 provides guidance on supply chain risk management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":652,"title":"IR.2.093","description":"<div>Detect and report events.</div><div><br></div><div>The monitoring, identification, and reporting of events are the foundation for incident identification and commence the incident life cycle. Events potentially affect the productivity of organizational assets and, in turn, associated services. These events must be captured and analyzed so that the organization can determine whether an event will become (or has become) an incident that requires organizational action. The extent to which an organization can identify events improves its ability to manage and control incidents and their potential effects.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":653,"title":"IR.2.094","description":"<div>Analyze and triage events to support event resolution and incident declaration.</div><div><br></div><div>The triage of event reports is an analysis activity that helps the organization to gather additional information for event resolution and to assist in incident declaration, handling, and response. Triage consists of categorizing, correlating, prioritizing, and analyzing events. Through triage, the organization determines the type and extent of an event (e.g., physical versus technical), whether the event correlates to other events (to determine if they are symptomatic of a larger issue, problem, or incident), and in what order events should be addressed or assigned for incident declaration, handling, and response. Triage also helps the organization to determine if the event needs to be escalated to other organizational or external staff (outside of the incident management staff) for additional analysis and resolution.&nbsp;</div><div><br></div><div>Some events will never proceed to incident declaration; the organization determines these events to be inconsequential. For events that the organization deems as low priority or of low impact or consequence, the triage process results in closure of the event and no further actions are performed.&nbsp;</div><div><br></div><div>Events that exit the triage process warranting additional attention may be referred to additional analysis processes for resolution or declared as an incident and subsequently referred to incident response processes for resolution. These events may be declared as incidents during triage, through further event analysis, through the application of incident declaration criteria, or during the development of response strategies, depending on the organization’s incident criteria, the nature and timing of the event(s), and the consequences of the event that the organization is currently experiencing or that is imminent.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":654,"title":"IR.2.096","description":"<div>Develop and implement responses to declared incidents according to pre-defined procedures.</div><div><br></div><div>Responding to an organizational incident is often dependent on proper advance planning by the organization in establishing, defining, and staffing an incident management capability.&nbsp;</div><div><br></div><div>Responding to an incident describes the actions the organization takes to prevent or contain the impact of an incident on the organization while it is occurring or shortly after it has occurred. The range, scope, and breadth of the organizational response will vary widely depending on the nature of the incident. Incident response may be as simple as notifying users to avoid opening a specific type of email message or as complicated as having to implement service continuity plans that require relocation of services and operations to an off-site provider. The broad range of potential incidents requires the organization to have a broad range of capability in incident response.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":655,"title":"IR.2.097","description":"<div>Perform root cause analysis on incidents to determine underlying causes.</div><div><br></div><div>Post-incident review is a formal part of the incident closure process. The organization conducts a formal examination of the causes of the incident and the ways in which the organization responded to it, as well as the administrative, technical, and physical control weaknesses that may have allowed the incident to occur.&nbsp;</div><div><br></div><div>Post-incident review should include a significant root-cause analysis process. The organization should employ commonly available techniques (such as cause-and-effect diagrams) to perform root-cause analysis as a means of potentially preventing future incidents of similar type and impact. Considerations of other processes that may have caused or aided the incident should be given, particularly as they may exist in processes such as change management and configuration management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":656,"title":"IR.3.098","description":"<div>Track, document, and report incidents to designated officials and/or authorities both internal and external to the organization.</div><div><br></div><div>Tracking and documenting system security incidents includes maintaining records about each incident, the status of the incident, and other pertinent information necessary for forensics, evaluating incident details, trends, and handling. Incident information can be obtained from a variety of sources including incident reports, incident response teams, audit monitoring, network monitoring, physical access monitoring, and user/administrator reports. Reporting incidents addresses specific incident reporting requirements within an organization and the formal incident reporting requirements for the organization. Suspected security incidents may also be reported and include the receipt of suspicious email communications that can potentially contain malicious code. The types of security incidents reported, the content and timeliness of the reports, and the designated reporting authorities reflect applicable laws, Executive Orders, directives, regulations, and policies.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Incident Response (IR)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":657,"title":"CM.5.074","description":"<div>Verify the integrity and correctness of security critical or essential software as defined by the organization (e.g., roots of trust, formal verification, or cryptographic signatures).</div><div><br></div><div>Verifying the integrity of the organization's security critical or essential software is an important capability as corrupted software is the primary attack vector used by adversaries to undermine or disrupt the proper functioning of organizational systems. There are many ways to verify software integrity and correctness throughout the system development life cycle. Root of trust mechanisms such as secure boot and trusted platform modules verify that only trusted code is executed during boot processes. This capability helps system components protect the integrity of boot firmware in organizational systems by verifying the integrity and authenticity of updates to the firmware prior to applying changes to the system component and preventing unauthorized processes from modifying boot firmware. Formal verification involves proving that a software program satisfies some formal property or set of properties. The nature of such formal verification is generally time consuming and not employed for most commercial operating systems and applications. Therefore, it would likely only be applied to some very limited uses such as verifying cryptographic protocols. However, in cases Where software exists with formal verification of its security properties, such software provides more assurance and trustworthiness and is preferred over similar software that has not been formally verified. The use of cryptographic signatures ensures the integrity and authenticity of critical and essential software that stores, processes, transmits, or protects CUI. Cryptographic signatures include digital signatures and the computation and application of signed hashes using asymmetric cryptography; protecting the confidentiality of the key used to generate the hash; and using the public key to verify the hash information.&nbsp;</div><div><br></div><div>FIPS 140-3 provides security requirements for cryptographic modules. FIPS 180—4 and FIPS 202 provide secure hash standards. FIPS 186-4 provides a digital signature standard. NIST SP 800-147 provides BIOS protection guidance. The NIST Roots of Trust project provides additional guidance.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":658,"title":"CM.4.073","description":"<div>Employ application whitelisting and an application vetting process for systems identified by the organization.</div><div><br></div><div>The process used to identify software programs that are not authorized to execute on systems is commonly referred to as blacklisting. The process used to identify software programs that are authorized to execute on systems is commonly referred to as whitelisting. Whitelisting is the stronger of the two policies for restricting software program execution. In addition to whitelisting, organizations consider verifying the integrity of whitelisted software programs using, for example, cryptographic checksums, digital signatures, or hash functions. Verification of whitelisted software can occur either prior to execution or at system startup. This practices requires the use of application whitelisting where feasible. NIST SP 800-167 provides guidance on application whitelisting.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":659,"title":"CM.3.069","description":"<div>Apply deny-by-exception (blacklisting) policy to prevent the use of unauthorized software or deny-all, permit-by-exception (whitelisting) policy to allow the execution of authorized software.</div><div><br></div><div>The process used to identity software programs that are not authorized to execute on systems is commonly referred to as blacklisting. The process used to identify software programs that are authorized to execute on systems is commonly referred to as whitelisting.&nbsp; Whitelisting is the stronger of the two policies for restricting software program execution. In addition to whitelisting, organizations consider verifying the integrity of whitelisted software programs using, for example, cryptographic checksums, digital signatures, or hash functions. Verification of whitelisted software can occur either prior to execution or at system startup.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":660,"title":"CM.3.068","description":"<div>Restrict, disable, or prevent the use of nonessential programs, functions, ports, protocols, and services.</div><div><br></div><div>Restricting the use of nonessential software (programs) includes restricting the roles allowed to approve program execution; prohibiting auto-execute; program blacklisting and whitelisting; or restricting the number of program instances executed at the same time. The organization makes a security—based determination which functions, ports, protocols, and/ or services are restricted. Bluetooth, FTP, and peer-to-peer networking are examples of protocols organizations consider preventing the use of, restricting, or disabling.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":661,"title":"AU.4.053","description":"<div>Automate analysis of audit logs to identify and act on critical indicators (TTPs) and/or organizationally defined suspicious activity.</div><div><br></div><div>Adversary activity typically leaves indications in audit logs. Patterns and signatures from previously seen adversary activity or malicious software are shared and can be used in automated analysis. Organizations can define thresholds for the level and definition of suspicious activity on which to take an action. The automated activity can be distributed or centralized.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":662,"title":"AU.4.054","description":"<div>Review audit information for broad activity in addition to per-machine activity.</div><div><br></div><div>The full scope of adversary activity may not be apparent from analyzing a single machine. A broad perspective is necessary for full cyber security situational awareness. Activity might be reviewed across multiple machines, an enclave, or an entire enterprise. This will require audit logs collated with the same scope as the analysis.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":663,"title":"AU.5.055","description":"<div>Identify assets not reporting audit logs and assure appropriate organizationally defined systems are logging.</div><div><br></div><div>Practice AU.2.042 required the creation and retention of audit logs. Audit logs are essential to cyber security awareness and incident response. This practice requires organizations to proactively determine if any assets that should be creating audit logs are not generating the required logs.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1},{"id":664,"title":"CA.2.157","description":"<div>Develop, document, and periodically update the system security plans that describe system boundaries, system environments of operation, how security requirements are implemented, and the relationships with or connections to other systems.</div><div><br></div><div>System security plans relate security requirements to a set of security controls. System security plans also describe, at a high level, how the security controls meet those security requirements, but do not provide detailed, technical descriptions of the design or implementation of the controls. System security plans contain sufficient information to enable a design and implementation that is unambiguously compliant with the intent of the plans and subsequent determinations of risk if the plan is implemented as intended. Security plans need not be single documents; the plans can be a collection of various documents including documents that already exist. Effective security plans make extensive use of references to policies, procedures, and additional documents (e.g., design and implementation specifications) where more detailed information can be obtained. This reduces the documentation requirements associated with security programs and maintains security—related information in other established management/ operational areas related to enterprise architecture, system development life cycle, systems engineering, and acquisition.&nbsp;</div><div><br></div><div>Federal agencies may consider the submitted system security plans and plans of action as critical inputs to an overall risk management decision to process, store, or transmit CUI on a system hosted by a non-federal organization and whether it is advisable to pursue an agreement or contract with the non-federal organization.&nbsp;</div><div><br></div><div>NIST SP 800—18 provides guidance on developing security plans.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":665,"title":"CA.2.158","description":"<div>Periodically assess the security controls in organizational systems to determine if the controls are effective in their application.</div><div><br></div><div>Organizations assess security controls in organizational systems and the environments in which those systems operate as part of the system development life cycle. Security controls are the safeguards or countermeasures organizations implement to satisfy security requirements. By assessing the implemented security controls, organizations determine if the security safeguards or counter-measures are in place and operating as intended. Security control assessments ensure that information security is built into organizational systems; identify weaknesses and deficiencies early in the development process; provide essential information needed to make risk-based decisions; and ensure compliance to vulnerability mitigation procedures. Assessments are conducted on the implemented security controls as documented in system security plans.&nbsp;</div><div><br></div><div>Security assessment reports document assessment results in sufficient detail as deemed necessary by organizations, to determine the accuracy and completeness of the reports and whether the security controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting security requirements. Security assessment results are provided to the individuals or roles appropriate for the types of assessments being conducted.&nbsp;</div><div><br></div><div>Organizations ensure that security assessment results are current, relevant to the determination of security control effectiveness, and obtained with the appropriate level of assessor independence. Organizations can choose to use other types of assessment activities such as vulnerability scanning and system monitoring to maintain the security posture of systems during the system life cycle.&nbsp;</div><div><br></div><div>NIST SP 800-53 provides guidance on security and privacy controls for systems and organizations. SP 800-53A provides guidance on developing security assessment plans and conducting assessments.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":666,"title":"CA.2.159","description":"<div>Develop and implement plans of action designed to correct deficiencies and reduce or eliminate vulnerabilities in organizational systems.</div><div><br></div><div>The plan of action is a key document in the information security program. Organizations develop plans of action that describe how any un-implemented security requirements will be met and how any planned mitigations will be implemented. Organizations can document the system security plan and plan of action as separate or combined documents and in any chosen format.&nbsp;</div><div><br></div><div>&nbsp;Federal agencies may consider the submitted system security plans and plans of action as critical inputs to an overall risk management decision to process, store, or transmit CUI on a system hosted by a non=federal organization and whether it is advisable to pursue an agreement or contract with the non-federal organization.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":667,"title":"CA.3.161","description":"<div>Monitor security controls on an ongoing basis to ensure the continued effectiveness of the controls.</div><div><br></div><div>Continuous monitoring programs facilitate ongoing awareness of threats, vulnerabilities, and information security to support organizational risk management decisions. The terms continuous and ongoing imply that organizations assess and analyze security controls and information security-related risks at a frequency sufficient to support risk-based decisions. The results of continuous monitoring programs generate appropriate risk response actions by organizations. Providing access to security information on a continuing basis through reports or dashboards gives organizational officials the capability to make effective and timely risk management decisions. Automation supports more frequent updates to hardware, software, firmware inventories, and other system information. Effectiveness is further enhanced when continuous monitoring outputs are formatted to provide information that is specific, measurable, actionable, relevant, and timely. Monitoring requirements, including the need for specific monitoring, may also be referenced in other requirements.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":668,"title":"CA.3.162","description":"<div>Employ a security assessment of enterprise software that has been developed internally, for internal use, and that has been organizationally defined as an area of risk.</div><div><br></div><div>Creating secure software implementations is difficult and requires extra steps to assess the code for security related vulnerabilities. Security assessment is a process of reviewing software source code in order to identify defects or vulnerabilities within an application. Security assessment may be done using manual or automated techniques.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":669,"title":"AU.3.051","description":"<div>Correlate audit record review, analysis, and reporting processes for investigation and response to indications of unlawful, unauthorized, suspicious, or unusual activity.</div><div><br></div><div>Correlating audit record review, analysis, and reporting processes helps to ensure that they do not operate independently, but rather collectively. Regarding the assessment of a given organizational system, the requirement is agnostic as to whether this correlation is applied at the system level or at the organization level across all systems.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Audit and Accountability (AU)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":670,"title":"CA.4.163","description":"<div>Create, maintain, and leverage a security strategy and roadmap for organizational cybersecurity improvement.</div><div><br></div><div>As organizations become more mature in their cyber security operations, it is expected that an organization will create, maintain, and leverage a security roadmap to show their planned path forward for improvements. This demonstrates a maturity level within an organization that is above the average company. The security roadrrrap will help a company move forward with increasing their overall security posture based on priority, cost, and implementation time. Such planning will help an organization line up vendors to discuss the planning and what solutions they may offer, receiving bids to help with the work, or get a bid on a cybersecurity appliance that will be installed on location or an \"as a service\" solution from a cloud provider that will be utilized remotely. This roadmap should be used to help plan based on areas of highest risk, latest TTPs, and or knowledge that a specific industry is being targeted and pushing solutions forward that will thwart malicious activities. A roadmap will require updates from time to time based on intelligence or architecture needs. A roadmap will survive people changing positions, and it will provide continuity plan for improving the cybersecurity posture of an organization.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":671,"title":"CA.4.227","description":"<div>Periodically perform red teaming against organizational assets in order to validate defensive capabilities.</div><div><br></div><div>Red Teaming is a specialized type of assessment conducted against an organization’s architecture with the goal to emulate adversary actions. This practice is focused on performing red teaming for the purpose of validating defensive capabilities in place (access controls, email protections, network segmentation, firewalls, and the defensive tools that help monitor all activities). It is recommended that red teaming events be coordinated with the defensive cyber teams of an organization in order to validate defensive cyber capabilities. This testing will help shape where defensive resources are allocated and where funding is needed to improve the overall security posture of the organization. This activity includes some vulnerability analysis, similar to a pentesting effort, but the main purpose is to validate defensive security mechanisms are providing the information needed to identify, disrupt, or thwart attacks on the network Any and all findings need to be rolled into a prioritized security plan based on risk, cost, and time to implement.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":672,"title":"CM.2.061","description":"<div>Establish and maintain baseline configurations and inventories of organizational systems (including hardware, software, firmware, and documentation) throughout the respective system development life cycles.</div><div><br></div><div>This requirement establishes and maintains baseline configurations for systems and system components including for system communications and connectivity. Baseline configurations are documented, formally reviewed, and agreed-upon sets of specifications for systems or configuration items within those systems. Baseline configurations serve as a basis for future builds, releases, and changes to systems. Baseline configurations include information about system components (e.g., standard software packages installed on workstations, notebook computers, servers, network components, or mobile devices; current version numbers and update and patch information on operating systems and applications; and configuration settings and parameters), network topology, and the logical placement of those components within the system architecture. Baseline configurations of systems also reflect the current enterprise architecture. Maintaining effective baseline configurations requires creating new baselines as organizational systems change over time. Baseline configuration maintenance includes reviewing and updating the baseline configuration when changes are made based on security risks and deviations from the established baseline configuration. &nbsp;</div><div><br></div><div>Organizations can implement centralized system component inventories that include components from multiple organizational systems. In such situations, organizations ensure that the resulting inventories include system-specific information required for proper component accountability (e.g., system association, system owner). Information deemed necessary for effective accountability of system components includes hardware inventory specifications, software license information, software version numbers, component owners, and for networked components or devices, machine names and network addresses. Inventory specifications include manufacturer, device type, model, serial number, and physical location.&nbsp;</div><div><br></div><div>NIST SP 800-128 provides guidance on security-focused configuration management.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":673,"title":"CM.2.062","description":"<div>Employ the principle of least functionality by configuring organizational systems to provide only essential capabilities.</div><div><br></div><div>Systems can provide a wide variety of functions and services. Some of the functions and services routinely provided by default, may not be necessary to support essential organizational missions, functions, or operations. It is sometimes convenient to provide multiple services from single system components. However, doing so increases risk over limiting the services provided by any one component. Where feasible, organizations limit component functionality to a single function per component.&nbsp; </div><div><br></div><div>Organizations review functions and services provided by systems or components of systems, to determine which functions and services are candidates for elimination. Organizations disable unused or unnecessary physical and logical ports and protocols to prevent unauthorized connection of devices, transfer of information, and tunneling. Organizations can utilize network scanning tools, intrusion detection and prevention systems, and end- point protections such as firewalls and host—based intrusion detection systems to identify and prevent the use of prohibited functions, ports, protocols, and services.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":674,"title":"CM.2.063","description":"<div>Control and monitor user-installed software.</div><div><br></div><div>Users can install software in organizational systems if provided the necessary privileges. To maintain control over the software installed, organizations identify permitted and prohibited actions regarding software installation through policies. Permitted software installations include updates and security patches to existing software and applications from organization-approved “app stores.\" Prohibited software installations may include software with unknown or suspect pedigrees or software that organizations consider potentially malicious. The policies organizations select governing user-installed software may be organization-developed or provided by some external entity. Policy enforcement methods include procedural methods, automated methods, or both.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":675,"title":"CM.2.064","description":"<div>Establish and enforce security configuration settings for information technology products employed in organizational systems.</div><div><br></div><div>Configuration settings are the set of parameters that can be changed in hardware, software, or firmware components of the system that affect the security posture or functionality of the system. Information technology products for which security-related configuration settings can be defined include mainframe computers, servers, workstations, input and output devices (e.g., scanners, copiers, and printers), network components (e.g., firewalls, routers, gateways, voice and data switches, wireless access points, network appliances, sensors), operating systems, middleware, and applications.</div><div><br></div><div>Security parameters are those parameters impacting the security state of systems including the parameters required to satisfy other security requirements. Security parameters include: registry settings; account, file, directory permission settings; and settings for functions, ports, protocols, and remote connections. Organizations establish organization- wide configuration settings and subsequently derive specific configuration settings for systems. The established settings become part of the systems configuration baseline.&nbsp;</div><div><br></div><div>Common secure configurations (also referred to as security configuration checklists, lockdown and hardening guides, security reference guides, security technical implementation guides) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for specific information technology platforms/products and instructions for configuring those system components to meet operational requirements. Common secure configurations can be developed by a variety of organizations including information technology product developers, manufacturers, vendors, consortia, academia, industry, federal agencies, and other organizations in the public and private sectors.&nbsp;</div><div><br></div><div>NIST SP 800—70 and SP 800-128 provide guidance on security configuration settings.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":676,"title":"CM.2.065","description":"<div>Track, review, and approve, or disapprove, and log changes to organizational systems.</div><div><br></div><div>Tracking, reviewing, approving/disapproving, and logging changes is called configuration change control. Configuration change control for organizational systems involves the systematic proposal, justification, implementation, testing, review, and disposition of changes to the systems, including system upgrades and modifications. Configuration change control includes changes to baseline configurations for components and configuration items of systems, changes to configuration settings for information technology products (e.g., operating systems, applications, firewalls, routers, and mobile devices), unscheduled and unauthorized changes, and changes to remediate vulnerabilities.&nbsp;</div><div><br></div><div>Processes for managing configuration changes to systems include Configuration Control Boards or Change Advisory Boards that review and approve proposed changes to systems. For new development systems or systems undergoing major upgrades, organizations consider including representatives from development organizations on the Configuration Control Boards or Change Advisory Boards. Audit logs of changes include activities before and after changes are made to organizational systems and the activities required to implement such changes.&nbsp;</div><div><br></div><div>NIST SP 800-128 provides guidance on configuration change control.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":677,"title":"CM.2.066","description":"<div>Analyze the security impact of changes prior to implementation.</div><div><br></div><div>Organizational personnel with information security responsibilities (e.g., system administrators, system security officers, system security managers, and systems security engineers) conduct security impact analyses. Individuals conducting security impact analyses possess the necessary skills and technical expertise to analyze the changes to systems and the associated security ramifications. Security impact analysis may include reviewing security plans to understand security requirements and reviewing system design documentation to understand the implementation of controls and how specific changes might affect the controls. Security impact analyses may also include risk assessments to better understand the impact of the changes and to determine if additional controls are required.&nbsp;</div><div><br></div><div>NIST SP 800-128 provides guidance on configuration change control and security impact analysis.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 2 - Intermediate Cyber Hygiene","tenantsId":1},{"id":678,"title":"CM.3.067","description":"<div>Define, document, approve, and enforce physical and logical access restrictions associated with changes to organizational systems.</div><div><br></div><div>Any changes to the hardware, software, or firmware components of systems can potentially have significant effects on the overall security of the systems. Therefore, organizations permit only qualified and authorized individuals to access systems for purposes of initiating changes, including upgrades and modifications. Access restrictions for change also include software libraries. Access restrictions include physical and logical access control requirements, workflow automation, media libraries, abstract layers (e.g., changes implemented into external interfaces rather than directly into systems), and change windows (e.g., changes occur only during certain specified times). In addition to security concerns, commonly-accepted due diligence for configuration management includes access restrictions as an essential part in ensuring the ability to effectively manage the configuration.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Configuration Management (CM)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 3 - Good Cyber Hygiene","tenantsId":1},{"id":679,"title":"CA.4.164","description":"<div>Conduct penetration testing periodically, leveraging automated scanning tools and ad hoc tests using human experts.</div><div><br></div><div>Penetration testing is a specialized type of assessment conducted on systems or individual system components to identify weaknesses and vulnerabilities within the solution. Adversaries that obtain a foothold in a network can take advantage of any unpatched vulnerabilities. Penetration testing goes beyond automated vulnerability scanning, and the testing is conducted by penetration testing agents and teams with demonstrable skills and experience that includes technical expertise in network, operating system, and/ or application level security. Penetration testing is used to validate vulnerabilities or determine the degree of penetration resistance of systems to cyber-attacks. The resistance to attacks is similar to withstanding an adversary, but with constraints. Such constraints include time, resources, and skills. Penetration testing activities can receive support by utilizing automated vulnerability identification tools that are commercially available. Penetration testing can be conducted internally or externally on the hardware, software, or firmware components of a system and should exercise both physical and technical controls, where possible. A standard method for penetration testing includes pretest analysis based on full knowledge of the system; pretest identification of potential vulnerabilities based on pretest analysis ; and testing designed to determine exploitability of vulnerabilities. All parties agree to the rules of engagement before commencement of penetration testing scenarios. Organizations correlate the rules of engagement for penetration tests with the tools, techniques, and procedures that are anticipated to be employed by adversaries. The penetration testing team may be organization-based or external to the organization. In either case, it is important that the team possesses the necessary skills and resources to do the job and is objective in its assessment. The findings from the penetration testing should be placed in a final report. Any and all findings need to be rolled into a prioritized security plan based on risk, cost, and time to implement.&nbsp;</div><div><br></div><div>NIST SP 800—5 3A provides guidance on conducting security assessments.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"Security Assessment (CA)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 4 - Proactive","tenantsId":1},{"id":680,"title":"SI.5.223","description":"<div>Monitor individuals and system components on an ongoing basis for anomalous or suspicious behavior.</div><div><br></div><div>Monitoring is used to identify unusual or unauthorized activities or conditions related to individual users and system components, for example, unusual internal systems communications traffic; unauthorized exporting of information; signaling to external systems; large file transfers; long-time persistent connections; attempts to access information from unexpected locations; unusual protocols and ports in use; and attempted communications with suspected malicious external addresses.</div><div><br></div><div>The correlation of physical audit record information and the audit records from systems may assist organizations in identifying examples of anomalous behavior. For example, the correlation of an individual’s identity for logical access to certain systems with the additional information that the individual was not present at the facility when the logical access occurred, is indicative of anomalous behavior. Indications of increased risk from individuals can be obtained from many sources including human resource records, intelligence agencies, law enforcement organizations, and other sources. The monitoring of specific individuals is closely coordinated with management, legal, security, privacy, and human resource officials in organizations conducting such monitoring, and in certain circumstances requires the prior authorization by a specified senior organizational official.<br></div>","references":"","relatedControls":"","subControls":"","enhancements":"","family":"System and Information Integrity (SI)","mappings":"","assessmentPlan":"","catalogueID":9,"practiceLevel":"Level 5 - Advanced/Progressive","tenantsId":1}],"tenantsId":1}